<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=5, minimum-scale=1">
    <meta name="msvalidate.01" content="B5163518CBE4A854B63801277FE5E35C" />
    <meta name="google-site-verification" content="ucqagxjVuq0lJZeLKs0F5AppzK111lNt3IoxU6mzlJE" />
    <meta name="robots" content="index, follow" />
    <meta name="googlebot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />
    <meta name="bingbot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />

    <meta property="og:locale" content="en_US" />
    <meta property="og:type" content="article" />

<script>(function(w,d,s,l,i){w[l]=w[l]||[];w[l].push({'gtm.start':new Date().getTime(),event:'gtm.js'});var f=d.getElementsByTagName(s)[0],j=d.createElement(s),dl=l!='dataLayer'?'&l='+l:'';j.async=true;j.src='https://www.googletagmanager.com/gtm.js?id='+i+dl;f.parentNode.insertBefore(j,f);})(window,document,'script','dataLayer','GTM-WK23PSS');</script>
<!-- Hotjar Tracking Code for staging -->
<script>
    (function(h,o,t,j,a,r){
        h.hj=h.hj||function(){(h.hj.q=h.hj.q||[]).push(arguments)};
        h._hjSettings={hjid:3587741,hjsv:6};
        a=o.getElementsByTagName('head')[0];
        r=o.createElement('script');r.async=1;
        r.src=t+h._hjSettings.hjid+j+h._hjSettings.hjsv;
        a.appendChild(r);
    })(window,document,'https://static.hotjar.com/c/hotjar-','.js?sv=');
</script>
<!-- End Hotjar Tracking code -->
    <title>Patterns in practice - Getting Started</title>
    <link rel="prev" href="../patterns/">
    <link rel="next" href="../results/">
      <meta name="description" content="This section describes how patterns are used in practice, explains the basic concepts of Cypher.">
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.css" />
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/utilities.min.css" />

    <link rel="preload" href="../../../assets/fonts/fontawesome-webfont.woff2?v=4.7.0" as="font">
    <link rel="stylesheet" href="../../../assets/css/site.css">
    <link href="https://fonts.googleapis.com/css2?family=Nunito+Sans:wght@300;400;600;700&display=swap" rel="stylesheet">

    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />



    <meta property="neo:type" content="Docs">
    <meta property="neo:site" content="Reference Docs">


    <meta property="og:site_name" content="Neo4j Graph Data Platform" />
    <meta property="article:publisher" content="https://www.facebook.com/neo4j.graph.database" />
    <meta name="twitter:card" content="summary_large_image" />
    <meta name="twitter:creator" content="@neo4j" />
    <meta name="twitter:site" content="@neo4j" />
    <meta property="og:type" content="article" />
    <meta property="og:title" content="Patterns in practice - Getting Started" />
    <meta property="og:locale" content="en_US" />
    <meta property="og:image" content="https://dist.neo4j.com/wp-content/uploads/20210423062553/neo4j-social-share-21.png" />
    <meta property="og:description" content="This section describes how patterns are used in practice, explains the basic concepts of Cypher." />
    <meta property="og:url" content="https://neo4j.com/docs/getting-started/cypher-intro/patterns-in-practice/" />
    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />
  </head>
  <body class="article docs">
<!-- Google Tag Manager (noscript) -->
<noscript><iframe src="https://www.googletagmanager.com/ns.html?id=GTM-WK23PSS"
height="0" width="0" style="display:none;visibility:hidden"></iframe></noscript>
<!-- End Google Tag Manager (noscript) -->
<script>(function(f,b){if(!b.__SV){var e,g,i,h;window.mixpanel=b;b._i=[];b.init=function(e,f,c){function g(a,d){var b=d.split(".");2==b.length&&(a=a[b[0]],d=b[1]);a[d]=function(){a.push([d].concat(Array.prototype.slice.call(arguments,0)))}}var a=b;"undefined"!==typeof c?a=b[c]=[]:c="mixpanel";a.people=a.people||[];a.toString=function(a){var d="mixpanel";"mixpanel"!==c&&(d+="."+c);a||(d+=" (stub)");return d};a.people.toString=function(){return a.toString(1)+".people (stub)"};i="disable time_event track track_pageview track_links track_forms track_with_groups add_group set_group remove_group register register_once alias unregister identify name_tag set_config reset opt_in_tracking opt_out_tracking has_opted_in_tracking has_opted_out_tracking clear_opt_in_out_tracking start_batch_senders people.set people.set_once people.unset people.increment people.append people.union people.track_charge people.clear_charges people.delete_user people.remove".split(" ");
for(h=0;h<i.length;h++)g(a,i[h]);var j="set set_once union unset remove delete".split(" ");a.get_group=function(){function b(c){d[c]=function(){call2_args=arguments;call2=[c].concat(Array.prototype.slice.call(call2_args,0));a.push([e,call2])}}for(var d={},e=["get_group"].concat(Array.prototype.slice.call(arguments,0)),c=0;c<j.length;c++)b(j[c]);return d};b._i.push([e,f,c])};b.__SV=1.2;e=f.createElement("script");e.type="text/javascript";e.async=!0;e.src="undefined"!==typeof MIXPANEL_CUSTOM_LIB_URL?
MIXPANEL_CUSTOM_LIB_URL:"file:"===f.location.protocol&&"//cdn.mxpnl.com/libs/mixpanel-2-latest.min.js".match(/^\/\//)?"https://cdn.mxpnl.com/libs/mixpanel-2-latest.min.js":"//cdn.mxpnl.com/libs/mixpanel-2-latest.min.js";g=f.getElementsByTagName("script")[0];g.parentNode.insertBefore(e,g)}})(document,window.mixpanel||[]);
mixpanel.init("4bfb2414ab973c741b6f067bf06d5575", {batch_requests: true})
mixpanel.track("Page View", {
    pathname: window.location.origin + window.location.pathname,
    search: window.location.search,
    hash: window.location.hash,
    referrer: document.referrer,
})
</script>
<header class="header">
  <nav class="navbar">
    <div class="navbar-brand">
      <a class="navbar-item" href="/">

      <img class="navbar-logo" src="https://dist.neo4j.com/wp-content/uploads/20210422142941/neo4j-logo-2020.svg" alt="Neo4j Docs" />
      <a href="/docs/" class="navbar-item no-left-padding" aria-label="Docs">
        Docs
      </a>

      </div>

      <button class="navbar-search search-button" data-target="topbar-nav" id="search_open_mobile" aria-label="Open Search">
        <svg width="23px" height="23px" viewBox="0 0 23 23" version="1.1" class="fill-current float-right" id="searchx" role="button" title="Search Website">
          <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
            stroke-linejoin="round">
            <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
              <circle
                transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                cx="11.3893642" cy="11.3885639" r="8.056"></circle>
              <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
            </g>
          </g>
        </svg>
      </button>
      <button class="navbar-burger" data-target="topbar-nav" aria-label="Mobile Navigation Button">
        <span></span>
        <span></span>
        <span></span>
      </button>
    </div>
    <div id="topbar-nav" class="navbar-menu">
            <div class="navbar-end">


        <div class="navbar-item has-dropdown is-hoverable docs">
          <a class="navbar-link" href="/docs/">Docs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <span class="project-name">Neo4j DBMS</span>
              <ul class="project-links">
                <li><a href="/docs/getting-started/current/" class="project-link">Getting Started</a></li>
                <li><a href="/docs/operations-manual/current/" class="project-link">Operations</a></li>
                <li><a href="/docs/migration-guide/current/" class="project-link">Migration and Upgrade</a></li>
                <li><a href="/docs/status-codes/current/" class="project-link">Status Codes</a></li>
                <li><a href="/docs/java-reference/current/" class="project-link">Java Reference</a></li>
                <li><a href="/docs/kerberos-add-on/current/" class="project-link">Kerberos Add-on</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="/docs/aura/">Neo4j Aura</a>
              <ul class="project-links">
                <li><a class="project-link" href="/docs/aura">Neo4j Aura</a></li>
                <li><a class="project-link" href="/docs/aura/auradb/">Neo4j AuraDB</a></li>
                <li><a class="project-link" href="/docs/aura/aurads/">Neo4j AuraDS</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Tools</span>
              <ul class="project-links">
                <li><a href="/docs/bloom-user-guide/current/" class="project-link">Neo4j Bloom</a></li>
                <li><a href="/docs/browser-manual/current/" class="project-link">Neo4j Browser</a></li>
                <li><a href="/docs/data-importer/current/" class="project-link">Neo4j Data Importer</a></li>
                <li><a href="/docs/desktop-manual/current/" class="project-link">Neo4j Desktop</a></li>
                <li><a href="/docs/ops-manager/current/" class="project-link">Neo4j Ops Manager</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Graph Data Science</span>
              <ul class="project-links">
                <li><a href="/docs/graph-data-science/current/" class="project-link">Neo4j Graph Data Science Library</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Cypher Query Language</span>
              <ul class="project-links">
                <li><a href="/docs/cypher-manual/current/" class="project-link">Cypher</a></li>
                <li><a href="/docs/cypher-cheat-sheet/current/" class="project-link">Cypher Cheat Sheet</a></li>
                <li><a href="/docs/apoc/current/" class="project-link">APOC Library</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name" href="/docs/drivers-apis">Create applications</span>
              <ul class="project-links">
                <li><a href="/docs/python-manual/current/" class="project-link">Python Driver</a></li>
                <li><a href="/docs/go-manual/current/" class="project-link">Go Driver</a></li>
                <li><a href="/docs/java-manual/current/" class="project-link">Java Driver</a></li>
                <li><a href="/docs/javascript-manual/current/" class="project-link">JavaScript Driver</a></li>
                <li><a href="/docs/dotnet-manual/current/" class="project-link">.Net Driver</a></li>
                <li><a href="/docs/graphql-manual/current/" class="project-link">Neo4j GraphQL Library</a></li>
                <li><a href="/docs/http-api/current/" class="project-link">HTTP API</a></li>
                <li><a href="/docs/ogm-manual/current/" class="project-link">OGM Library</a></li>
                <li><a href="https://docs.spring.io/spring-data/neo4j/docs/current/reference/html/#reference" class="project-link">Spring Data Neo4j</a></li>
                <li><a href="/docs/spark/" class="project-link">Neo4j Connector for Apache Spark</a></li>
                <li><a href="/docs/kafka/" class="project-link">Neo4j Connector for Apache Kafka</a></li>
              </ul>
            </div>

          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable labs">
          <a class="navbar-link" href="/labs/">Labs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="/labs/arrows/">arrows.app</a>
              <ul class="project-links">
                <li><a href="/labs/arrows/" class="project-link">Details</a></li>
                <li><a href="https://arrows.app" class="project-link">arrows.app</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/apoc/">APOC Extended</a>

              <ul class="project-links">
                <li><a href="/labs/apoc/5/" class="project-link">Documentation</a></li>
                <li><a href="/developer/neo4j-apoc/" class="project-link">Developer Guide</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/halin/">Halin</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/etl-tool/">ETL Tool</a>
              <ul class="project-links">
                <li><a href="/labs/etl-tool/" class="project-link">Details</a></li>
                <li><a href="/labs/etl-tool/1.5.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neo4j-migrations/">Neo4j Migrations</a>
              <ul class="project-links">
                <li><a href="/labs/neo4j-migrations/" class="project-link">Details</a></li>
                <li><a href="/labs/neo4j-migrations/2.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/liquibase/">Neo4j Plugin For Liquibase</a>
              <ul class="project-links">
                <li><a href="/labs/liquibase/" class="project-link">Details</a></li>
                <li><a href="https://github.com/liquibase/liquibase-neo4j" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neosemantics/">Neosemantics</a>
              <ul class="project-links">
                <li><a href="/labs/neosemantics/tutorial/" class="project-link">Getting Started</a></li>
                <li><a href="/labs/neosemantics/4.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neo4j-helm/">Neo4j Helm</a>
              <ul class="project-links">
                <li><a href="/labs/neo4j-helm/" class="project-link">Details</a></li>
                <li><a href="/labs/neo4j-helm/1.0.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neodash/">NeoDash</a>
              <ul class="project-links">
                <li><a href="/labs/neodash/" class="project-link">Details</a></li>
                <li><a href="/labs/neodash/2.1/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neomodel/">neomodel</a>
              <ul class="project-links">
                <li><a href="/labs/neomodel/" class="project-link">Details</a></li>
                <li><a href="https://neomodel.readthedocs.io/en/latest/" target="_blank" class="project-link">Documentation</a></li>
              </ul>
            </div>
          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable developer">
          <a class="navbar-link" href="/developer/resources/">Get Help</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="https://graphacademy.neo4j.com/?ref=docs" target="_blank">GraphAcademy</a>
              <ul class="project-links">
                <li><a class="project-link" href="https://graphacademy.neo4j.com/?ref=docs">Free, Self Paced Training</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/certification/?ref=docs" target="_blank">Certification</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/forum" target="_blank">Community Forum</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/chat" target="_blank">Discord Chat</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/developer/kb" target="_blank">Knowledge Base</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a>
            </div>
          </div>
        </div>
        <div class="navbar-item is-hoverable getting-started-cta">
          <a class="navbar-link primary" href="https://neo4j.com/cloud/platform/aura-graph-database/?ref=docs-nav-get-started">Get Started Free</a>
        </div>
        <div class="navbar-item">
          <a class="navbar-link search-button" href="#search" id="search_open"><svg width="23px" height="23px" viewBox="0 0 23 23"
              version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"
              class="fill-current float-right" id="search" role="button" title="Search Website">
              <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
                stroke-linejoin="round">
                <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
                  <circle
                    transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                    cx="11.3893642" cy="11.3885639" r="8.056"></circle>
                  <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
                </g>
              </g>
            </svg><span class="navbar-mobile">Search</span></a>
        </div>
      </div>
    </div>
  </nav>
</header>
<div class="body">
<div class="nav-container" data-component="getting-started" data-version="">
  <aside class="nav">
    <div class="panels">
      <div class="selectors">
        
      </div>
      <div class="nav-panel-menu is-active" data-panel="menu">
    <nav class="nav-menu">
    <ul class="nav-list">
  <li class="nav-item" data-depth="0">
<ul class="nav-list">
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../">Welcome to Neo4j</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../get-started-with-neo4j/">Get started with Neo4j</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../get-started-with-neo4j/graph-database/">What is a graph database?</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../data-modeling/">Model your data for Neo4j</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-modeling/guide-data-modeling/">Graph modeling guidelines</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-modeling/modeling-designs/">Modeling designs</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-modeling/relational-to-graph-modeling/">Modeling: relational to graph</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-modeling/modeling-tips/">Graph modeling tips</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-modeling/graph-model-refactoring/">Graph model refactoring</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-modeling/data-modeling-tools/">Data modeling tools</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../data-import/">Import your data into Neo4j</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-import/csv-import/">Importing CSV data into Neo4j</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-import/json-rest-api-import/">Importing JSON data from a REST API into Neo4j</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-import/relational-to-graph-import/">Import: RDBMS to graph</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../">Query a Neo4j database</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../cypher-sql/">Comparing Cypher with SQL</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../patterns/">Patterns</a>
  </li>
  <li class="nav-item is-current-page" data-depth="2">
    <a class="nav-link" href="./">Patterns in practice</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../results/">Getting the correct results</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../updating/">Updating the data</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../large-statements/">Composing large statements</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../subqueries/">Subqueries in Cypher</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../schema/">Defining a schema</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../dates-datetimes-durations/">Dates, datetimes, and durations</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../procedures-functions/">How to extend Cypher</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../load-csv/">Tutorial: Import data</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../resources/">Cypher resources</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../languages-guides/">Connect to Neo4j</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link nav-item-toggle" href="../../languages-guides/java/java-intro/">Using Neo4j from Java</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../languages-guides/java/spring-data-neo4j/">Spring Data Neo4j</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../languages-guides/java/quarkus/">Quarkus</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../languages-guides/java/java-frameworks/">Helidon, Micronaut</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../languages-guides/java/neo4j-ogm/">Neo4j - OGM Object Graph Mapper</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../languages-guides/java/java-procedures/">Procedures and Functions</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../languages-guides/neo4j-dotnet/">Using Neo4j from .NET</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../languages-guides/neo4j-javascript/">Neo4j from JavaScript</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../languages-guides/neo4j-python/">Using Neo4j from Python</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../languages-guides/neo4j-go/">Using Neo4j from Go</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../languages-guides/integration-tools/integration/">Neo4j Connectors</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../languages-guides/community-drivers/">Community-contributed libraries</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../gds/">Data science with Neo4j</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../graph-visualization/graph-visualization/">Visualize your data in Neo4j</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../graph-visualization/graph-visualization-tools/">Graph visualization tools</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../appendix/">Appendix</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link nav-item-toggle" href="../../appendix/graphdb-concepts/">Graph database concepts</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../appendix/graphdb-concepts/graphdb-vs-rdbms/">Transition from relational to graph database</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../appendix/graphdb-concepts/graphdb-vs-nosql/">Transition from NoSQL to graph database</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../appendix/example-data/">Example datasets</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../appendix/getting-started-resources/">Getting started resources</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link nav-item-toggle" href="../../appendix/tutorials/tutorials-overview/">Tutorials</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../appendix/tutorials/guide-cypher-basics/">Tutorial: Getting Started with Cypher</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../appendix/tutorials/guide-build-a-recommendation-engine/">Tutorial: Build a Cypher Recommendation Engine</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../appendix/tutorials/guide-import-relational-and-etl/">Tutorial: Import data from a relational database into Neo4j</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../appendix/tutorials/guide-import-desktop-csv/">How-To: Import CSV data with Neo4j Desktop</a>
  </li>
</ul>
  </li>
</ul>
  </li>
</ul>
  </li>
</ul>
  </nav>
</div>
    </div>
  </aside>
</div>
<main class="article">
<div class="toolbar" role="navigation">
  <div class="toolbar-wrapper">
    <button class="nav-toggle" aria-label="Toggle Table of Contents"></button>
    <a href="../../" class="home-link" aria-label="Go to home page"></a>
    <nav class="breadcrumbs" aria-label="breadcrumbs">
  <ul>
    <li><a href="../../">Getting Started</a></li>
    <li><a href="../">
        Query a Neo4j database
    </a></li>
    <li><a href="./">
        Patterns in practice
    </a></li>
  </ul>
</nav>
        <div class="edit-this-page"><a href="https://github.com/neo4j/docs-getting-started/tree/master/modules/ROOT/pages/cypher-intro/patterns-in-practice.adoc">Edit this Page</a></div>
    </div>
</div>

  <div class="content">
<article class="doc">
<div class="sect-header">
<h1 class="page">Patterns in practice</h1>
</div>





<div class="sect1">
<h2 id="cypher-intro-patterns-in-practice-creating-data"><a class="anchor" href="#cypher-intro-patterns-in-practice-creating-data"></a>Creating and returning data</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Let&#8217;s start by looking into the clauses that allow you to create data.</p>
</div>
<div class="paragraph">
<p>To add data, you just use the patterns you already know.
By providing patterns, you can specify what graph structures, labels, and properties you would like to make part of your graph.</p>
</div>
<div class="paragraph">
<p>Obviously the simplest clause is called <code>CREATE</code>.
It creates the patterns that you specify.</p>
</div>
<div class="paragraph">
<p>For the patterns you have looked at so far this could look like the following:</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CREATE (:Movie {title: 'The Matrix', released: 1997})</code></pre>
</div>
</div>
<div class="paragraph">
<p>If you run this statement, Cypher<sup>&reg;</sup> returns the number of changes: in this case adding one node, one label, and two properties.</p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Created Nodes: 1
Added Labels: 1
Set Properties: 2
Rows: 0</pre>
</div>
</div>
<div class="paragraph">
<p>As you started out with an empty database, you now have a database with a single node in it:</p>
</div>
<div class="imageblock middle">
<div class="content">
<img src="../../_images/cypher-intro-patterns-in-practice01-arr.svg" alt="cypher intro patterns in practice01 arr" width="350">
</div>
</div>
<div class="paragraph">
<p>If you also want to return the created data, you can add a <code>RETURN</code> clause, which refers to the variable you have assigned to your pattern elements.<br>
The <code>RETURN</code> keyword in Cypher specifies what values or results you might want to return from a Cypher query.<br>
You can tell Cypher to return nodes, relationships, node and relationship properties, or patterns in your query results.<br>
<code>RETURN</code> is not required when doing write procedures, but is needed for reads.<br>
The node and relationship variables, which are discussed <a href="../patterns/#cypher-intro-patterns-node-syntax" class="xref page">earlier</a>, become important when using <code>RETURN</code>.</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CREATE (p:Person {name: 'Keanu Reeves', born: 1964})
RETURN p</code></pre>
</div>
</div>
<div class="paragraph">
<p>This is what gets returned:</p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Created Nodes: 1
Added Labels: 1
Set Properties: 2
Rows: 1

+----------------------------------------------+
| p                                            |
+----------------------------------------------+
| (:Person {name: 'Keanu Reeves', born: 1964}) |
+----------------------------------------------+</pre>
</div>
</div>
<div class="paragraph">
<p>If you want to create more than one element, you can separate the elements with commas or use multiple <code>CREATE</code> statements.</p>
</div>
<div class="paragraph">
<p>You can, of course, also create more complex structures, like an <code>ACTED_IN</code> relationship with information about the character, or <code>DIRECTED</code> ones for the director.</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CREATE (a:Person {name: 'Tom Hanks', born: 1956})-[r:ACTED_IN {roles: ['Forrest']}]-&gt;(m:Movie {title: 'Forrest Gump', released: 1994})
CREATE (d:Person {name: 'Robert Zemeckis', born: 1951})-[:DIRECTED]-&gt;(m)
RETURN a, d, r, m</code></pre>
</div>
</div>
<div class="paragraph">
<p>This is the part of the updated graph:</p>
</div>
<div class="imageblock middle">
<div class="content">
<img src="../../_images/cypher-intro-patterns-in-practice02-arr.svg" alt="cypher intro patterns in practice02 arr" width="600">
</div>
</div>
<div class="paragraph">
<p>In most cases, you want to add new data to existing structures.
This requires knowing how to find existing patterns in your graph data, which is covered in the next section.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-patterns-in-practice-matching-patterns"><a class="anchor" href="#cypher-intro-patterns-in-practice-matching-patterns"></a>Matching patterns</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Matching patterns is a task for the <code>MATCH</code> statement.
You pass the same kind of patterns you have used so far to <code>MATCH</code> to describe what you are looking for.
It is similar to <em>query by example</em>, only that your examples also include the structures.
To bring back nodes, relationships, properties, or patterns, you need to have variables specified in your <code>MATCH</code> clause for the data you want to return.</p>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
<div class="paragraph">
<p>A <code>MATCH</code> statement searches for the patterns you specify and return <em>one row per successful pattern match</em>.</p>
</div>
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>To find the data you have created so far, you can start looking for all nodes labeled with the <code>Movie</code> label.</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Movie)
RETURN m</code></pre>
</div>
</div>
<div class="paragraph">
<p>Here&#8217;s the result:</p>
</div>
<div class="imageblock middle">
<div class="content">
<img src="../../_images/cypher-intro-patterns-in-practice03-arr.svg" alt="cypher intro patterns in practice03 arr" width="600">
</div>
</div>
<div class="paragraph">
<p>This should show both <em>The Matrix</em> and <em>Forrest Gump</em>.</p>
</div>
<div class="paragraph">
<p>You can also look for a specific person, like <em>Keanu Reeves</em>.</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person {name: 'Keanu Reeves'})
RETURN p</code></pre>
</div>
</div>
<div class="paragraph">
<p>This query returns the matching node:</p>
</div>
<div class="imageblock middle">
<div class="content">
<img src="../../_images/cypher-intro-patterns-in-practice04-arr.svg" alt="cypher intro patterns in practice04 arr" width="350">
</div>
</div>
<div class="paragraph">
<p>Note that you only provide enough information to find the nodes, not all properties are required.
In most cases, you have key-properties like SSN, ISBN, emails, logins, geolocation, or product codes to look for.</p>
</div>
<div class="paragraph">
<p>You can also find more interesting connections, like, for instance, the movies' titles that <em>Tom Hanks</em> acted in and roles he played.</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person {name: 'Tom Hanks'})-[r:ACTED_IN]-&gt;(m:Movie)
RETURN m.title, r.roles</code></pre>
</div>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 1

+------------------------------+
| m.title        | r.roles     |
+------------------------------+
| 'Forrest Gump' | ['Forrest'] |
+------------------------------+</pre>
</div>
</div>
<div class="paragraph">
<p>In this case, you only returned the properties of the nodes and relationships that you are interested in.
You can access them everywhere via a dot notation <code>identifer.property</code>.</p>
</div>
<div class="paragraph">
<p>Of course, this only lists T. Hank&#8217;s role as <em>Forrest</em> in <em>Forrest Gump</em> because that&#8217;s all data that you have added.</p>
</div>
<div class="paragraph">
<p>Now you know enough to add new nodes to existing ones and can combine <code>MATCH</code> and <code>CREATE</code> to attach structures to the graph.</p>
</div>
<div class="sect2">
<h3 id="cypher-examples"><a class="anchor" href="#cypher-examples"></a>Cypher examples</h3>
<div class="paragraph">
<p>Let us look at some examples of using <code>MATCH</code> and <code>RETURN</code> keywords.
Each subsequent example is more complicated than the previous one. The two last examples start with explanations of what we are trying to achieve. If you click the <strong>Run Query</strong> button below each Cypher code snippet, you can see the results in the format of a graph or table.</p>
</div>
<div class="ulist">
<ul>
<li>
<p><strong>Example 1:</strong> Find the labeled <code>Person</code> nodes in the graph.
Note that you must use a variable like <code>p</code> for the <code>Person</code> node if you want to retrieve the node in the <code>RETURN</code> clause.</p>
</li>
</ul>
</div>
<div class="listingblock runnable editable graph">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person)
RETURN p
LIMIT 1</code></pre>
</div>
</div>
<div class="ulist">
<ul>
<li>
<p><strong>Example 2:</strong> Find <code>Person</code> nodes in the graph that have a name of 'Tom Hanks'.
Remember that you can name your variable anything you want, as long as you reference that same name later.</p>
</li>
</ul>
</div>
<div class="listingblock runnable editable graph">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (tom:Person {name: 'Tom Hanks'})
RETURN tom</code></pre>
</div>
</div>
<div class="ulist">
<ul>
<li>
<p><strong>Example 3:</strong> Find which <code>Movie</code> Tom Hanks has directed.</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>Explanation: at first you should find Tom Hanks' <code>Person</code> node and after that the <code>Movie</code> nodes he is connected to.
To do that, you have to follow the <code>DIRECTED</code> relationship from Tom Hanks' <code>Person</code> node to the <code>Movie</code> node.
You have also specified a label of <code>Movie</code> so that the query only looks at nodes with that label.
Since you only care about returning the movie in this query, you need to give that node a variable (<code>movie</code>) but do not need to give variables for the <code>Person</code> node or <code>DIRECTED</code> relationship.</p>
</div>
<div class="listingblock runnable editable graph">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (:Person {name: 'Tom Hanks'})-[:DIRECTED]-&gt;(movie:Movie)
RETURN movie</code></pre>
</div>
</div>
<div class="ulist">
<ul>
<li>
<p><strong>Example 4:</strong> Find which <code>Movie</code> Tom Hanks has directed, but this time, return only the title of the movie.</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>Explanation: this query is similar to the previous one.
Example 3 returned the entire <code>Movie</code> node with all its properties.
For this example, you still need to find Tom&#8217;s movies, but now you only care about their titles.
You should access the node&#8217;s <code>title</code> property using the syntax <code>variable.property</code> to return the name value.</p>
</div>
<div class="listingblock runnable editable">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (:Person {name: 'Tom Hanks'})-[:DIRECTED]-&gt;(movie:Movie)
RETURN movie.title</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="cypher-aliases"><a class="anchor" href="#cypher-aliases"></a>Aliasing return values</h3>
<div class="paragraph">
<p>Not all properties are simple like <code>movie.title</code> in the example above.
Some properties have poor names due to property length, multi-word descriptions, developer jargon, and other shortcuts.
These naming conventions can be difficult to read, especially if they end up on reports and other user-facing interfaces.</p>
</div>
<div class="listingblock runnable">
<div class="title">Poorly-named properties</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//poorly-named property
MATCH (tom:Person {name:'Tom Hanks'})-[rel:DIRECTED]-(movie:Movie)
RETURN tom.name, tom.born, movie.title, movie.released</code></pre>
</div>
</div>
<div class="paragraph">
<p>Just like with SQL, you can rename return results by using the <code>AS</code> keyword and aliasing the property with a cleaner name.</p>
</div>
<div class="listingblock runnable editable">
<div class="title">Cleaner Results with aliasing</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//cleaner printed results with aliasing
MATCH (tom:Person {name:'Tom Hanks'})-[rel:DIRECTED]-(movie:Movie)
RETURN tom.name AS name, tom.born AS `Year Born`, movie.title AS title, movie.released AS `Year Released`</code></pre>
</div>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
<div class="paragraph">
<p>You can specify return aliases that have spaces by using the backtick character before and after the alias (movie.released AS <code>Year Released</code>).
If you do not have an alias that contains spaces, then you do not need to use backticks.</p>
</div>
</td>
</tr>
</table>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-patterns-in-practice-attaching-structures"><a class="anchor" href="#cypher-intro-patterns-in-practice-attaching-structures"></a>Attaching structures</h2>
<div class="sectionbody">
<div class="paragraph">
<p>To extend the graph with new information, you first match the existing connection points and then attach the newly created nodes to them with relationships.
Adding <em>Cloud Atlas</em> as a new movie for <em>Tom Hanks</em> could be achieved like this:</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person {name: 'Tom Hanks'})
CREATE (m:Movie {title: 'Cloud Atlas', released: 2012})
CREATE (p)-[r:ACTED_IN {roles: ['Zachry']}]-&gt;(m)
RETURN p, r, m</code></pre>
</div>
</div>
<div class="paragraph">
<p>Here&#8217;s what the structure looks like in the database:</p>
</div>
<div class="imageblock middle">
<div class="content">
<img src="../../_images/cypher-intro-patterns-in-practice05-arr.svg" alt="cypher intro patterns in practice05 arr" width="600">
</div>
</div>
<div class="admonitionblock tip">
<table>
<tr>
<td class="icon">
<i class="fa icon-tip" title="Tip"></i>
</td>
<td class="content">
<div class="paragraph">
<p>It is important to remember that you can assign variables to both nodes and relationships and use them later on, no matter if they were created or matched.</p>
</div>
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>It is possible to attach both node and relationship in a single <code>CREATE</code> clause.
For readability, it helps to split them up though.</p>
</div>
<div class="admonitionblock important">
<table>
<tr>
<td class="icon">
<i class="fa icon-important" title="Important"></i>
</td>
<td class="content">
<div class="paragraph">
<p>A tricky aspect of the combination of <code>MATCH</code> and <code>CREATE</code> is that you get <em>one row per matched pattern</em>.
This causes subsequent <code>CREATE</code> statements to be executed once for each row.
In many cases, this is what you want.
If that&#8217;s not intended, move the <code>CREATE</code> statement before the <code>MATCH</code>, or change the cardinality of the query with means discussed later or use the <em>get or create</em> semantics of the next clause: <strong><code>MERGE</code></strong>.</p>
</div>
</td>
</tr>
</table>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-patterns-in-practice-completing-patterns"><a class="anchor" href="#cypher-intro-patterns-in-practice-completing-patterns"></a>Completing patterns</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Whenever you get data from external systems or are not sure if certain information already exists in the graph, you want to be able to express a repeatable (idempotent) update operation.
In Cypher <strong><code>MERGE</code></strong> clause has this function.
It acts like a combination of <code>MATCH</code> <em>or</em> <code>CREATE</code>, which checks for the existence of data before creating it.
With <code>MERGE</code>, you define a pattern to be found or created.
Usually, as with <code>MATCH</code>, you only want to include the key property to look for in your core pattern.
<code>MERGE</code> allows you to provide additional properties you want to set <code>ON CREATE</code>.</p>
</div>
<div class="paragraph">
<p>If you do not know whether your graph already contained <em>Cloud Atlas</em>, you could merge it again.</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MERGE (m:Movie {title: 'Cloud Atlas'})
ON CREATE SET m.released = 2012
RETURN m</code></pre>
</div>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Created Nodes: 1
Added Labels: 1
Set Properties: 2
Rows: 1

+-------------------------------------------------+
| m                                               |
+-------------------------------------------------+
| (:Movie {title: 'Cloud Atlas', released: 2012}) |
+-------------------------------------------------+</pre>
</div>
</div>
<div class="paragraph">
<p>You get a result in both cases: either the data (potentially more than one row) that was already in the graph or a single, newly created <code>Movie</code> node.</p>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
<div class="paragraph">
<p>A <code>MERGE</code> clause without any previously assigned variables in it either matches the full pattern or creates the full pattern.
It never produces a partial mix of matching and creating within a pattern.
To achieve a partial match/create, make sure to use already defined variables for the parts that shouldn&#8217;t be affected.</p>
</div>
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>So foremost <code>MERGE</code> makes sure that you can&#8217;t create duplicate information or structures, but it comes with the cost of needing to check for existing matches first.
Especially on large graphs, it can be costly to scan a large set of labeled nodes for a specific property.
You can alleviate some of that by creating supporting indexes or constraints, which are discussed in the upcoming sections.
But it&#8217;s still not for free, so whenever you&#8217;re sure to not create duplicate data use <code>CREATE</code> over <code>MERGE</code>.</p>
</div>
<div class="admonitionblock tip">
<table>
<tr>
<td class="icon">
<i class="fa icon-tip" title="Tip"></i>
</td>
<td class="content">
<div class="paragraph">
<p><code>MERGE</code> can also assert that a relationship is only created once.
For that to work you <em>have to pass in</em> both nodes from a previous pattern match.</p>
</div>
</td>
</tr>
</table>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Movie {title: 'Cloud Atlas'})
MATCH (p:Person {name: 'Tom Hanks'})
MERGE (p)-[r:ACTED_IN]-&gt;(m)
ON CREATE SET r.roles =['Zachry']
RETURN p, r, m</code></pre>
</div>
</div>
<div class="imageblock middle">
<div class="content">
<img src="../../_images/cypher-intro-patterns-in-practice06-arr.svg" alt="cypher intro patterns in practice06 arr" width="600">
</div>
</div>
<div class="paragraph">
<p>If the direction of a relationship is arbitrary, you can leave off the arrowhead.
<code>MERGE</code> checks for the relationship in either direction and creates a new directed relationship if there is no matching relationship.</p>
</div>
<div class="paragraph">
<p>If you choose to pass in only one node from a preceding clause, <code>MERGE</code> offers an interesting functionality.
It only matches within the direct neighborhood of the provided node for the given pattern, and if the pattern is not found creates it.
This can come in very handy for creating, for example, tree structures.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CREATE (y:Year {year: 2014})
MERGE (y)&lt;-[:IN_YEAR]-(m10:Month {month: 10})
MERGE (y)&lt;-[:IN_YEAR]-(m11:Month {month: 11})
RETURN y, m10, m11</code></pre>
</div>
</div>
<div class="paragraph">
<p>This is the graph structure that gets created:</p>
</div>
<div class="imageblock middle">
<div class="content">
<img src="../../_images/cypher-intro-patterns-in-practice07-arr.svg" alt="cypher intro patterns in practice07 arr" width="600">
</div>
</div>
<div class="paragraph">
<p>Here is no global search for the two <code>Month</code> nodes; they are only searched for in the context of the <em>2014</em> <code>Year</code> node.</p>
</div>
</div>
</div>
<div class="sect1 arrange">
<h2 id="_code_challenge"><a class="anchor" href="#_code_challenge"></a>Code challenge</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Now knowing the basics, use the parts below to build a Cypher statement to find the <code>title</code> and year of <code>release</code> for every <code>:Movie</code> that Tom Hanks has <code>:DIRECTED</code>.
Click the parts to add them in order and once you are done, click <strong>Run Query</strong> to see whether you have got it right.
You can click any part of the query inside the code block to remove it.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person {name: "Tom Hanks"})-[:DIRECTED]-&gt;(m:Movie) RETURN m.title, m.released</code></pre>
</div>
</div>
</div>
</div>
<nav class="pagination">
  <span class="prev"><a href="../patterns/">Patterns</a></span>

  <span class="next"><a href="../results/">Getting the correct results</a></span>
</nav>
    <div class="feedback">
    <div class="header question">
        <p><strong>Was this page helpful?</strong></p>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="no" aria-label="No, this page isn't helpful">
            <path
                d="M6.25,15.8333333 C6.25,13.7622655 7.92893219,12.0833333 10,12.0833333 C12.0710678,12.0833333 13.75,13.7622655 13.75,15.8333333"
                ></path>
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M12.5,4.58333333 C12.8934466,4.05873783 13.5109223,3.75 14.1666667,3.75 C14.822411,3.75 15.4398867,4.05873783 15.8333333,4.58333333"
                ></path>
            <line x1="4.58333333" y1="7.91666667" x2="7.08333333" y2="7.91666667" ></line>
            <path
                d="M7.08333333,8.54166667 C6.96827401,8.54166667 6.875,8.44839266 6.875,8.33333333 C6.875,8.21827401 6.96827401,8.125 7.08333333,8.125 C7.19839266,8.125 7.29166667,8.21827401 7.29166667,8.33333333 C7.29166667,8.44839266 7.19839266,8.54166667 7.08333333,8.54166667"
                ></path>
            <line x1="12.9166667" y1="7.91666667" x2="15.4166667" y2="7.91666667" ></line>
            <path
                d="M15.4166667,8.54166667 C15.3016073,8.54166667 15.2083333,8.44839266 15.2083333,8.33333333 C15.2083333,8.21827401 15.3016073,8.125 15.4166667,8.125 C15.531726,8.125 15.625,8.21827401 15.625,8.33333333 C15.625,8.44839266 15.531726,8.54166667 15.4166667,8.54166667"
                ></path>
            <path
                d="M4.16666667,4.58333333 C4.5601133,4.05873783 5.17758895,3.75 5.83333333,3.75 C6.48907772,3.75 7.10655337,4.05873783 7.5,4.58333333"
                ></path>
        </svg>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="yes" aria-label="Yes, this page is helpful">
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M5.41666667,8.125 C5.53172599,8.125 5.625,8.21827401 5.625,8.33333333 C5.625,8.44839266 5.53172599,8.54166667 5.41666667,8.54166667 C5.30160734,8.54166667 5.20833333,8.44839266 5.20833333,8.33333333 C5.20833333,8.21827401 5.30160734,8.125 5.41666667,8.125"
                ></path>
            <path
                d="M14.5833333,8.125 C14.468274,8.125 14.375,8.21827401 14.375,8.33333333 C14.375,8.44839266 14.468274,8.54166667 14.5833333,8.54166667 C14.6983927,8.54166667 14.7916667,8.44839266 14.7916667,8.33333333 C14.7916667,8.21827401 14.6983927,8.125 14.5833333,8.125"
                ></path>
            <path
                d="M13.2275,12.9166657 C13.4853075,12.9162808 13.7287776,13.035241 13.8869095,13.2388563 C14.0450415,13.4424715 14.1000278,13.7078123 14.0358333,13.9575 C13.562901,15.7999679 11.9021969,17.0882321 10,17.0882321 C8.09780311,17.0882321 6.43709903,15.7999679 5.96416667,13.9575 C5.89997223,13.7078123 5.95495852,13.4424715 6.11309045,13.2388563 C6.27122239,13.035241 6.51469246,12.9162808 6.7725,12.9166657 L13.2275,12.9166657 Z"
                ></path>
        </svg>
    </div>


</div></article>
<aside class="toc sidebar" data-title="Contents"
  data-levels="2">
  <div class="toc-menu">
    <div class="toc-menu-placeholder"></div>

    <div class="toc-ad">
    <div class="toc-ad-overline">
        <a href="https://graphacademy.neo4j.com/courses/cypher-fundamentals" target="_blank">

        Neo4j GraphAcademy

        </a>
    </div>

    <a href="https://graphacademy.neo4j.com/courses/cypher-fundamentals" target="_blank">

        <h2 class="toc-ad-title">
            Cypher Fundamentals
        </h2>

        <p class="toc-ad-description">Learn Cypher in this free, hands-on course</p>

        <div class="toc-ad-underline button">
            Learn more
        </div>
    </a>
</div>
  </div>
  </aside>  </div>
</main>
</div>
<footer class="footer">
  <div class="wrapper">
  <div class="column">
    <div class="logo-footer"></div>
    <p> <span id="footer-copyright-year">2023</span> Neo4j, Inc.<br>
      <a href="https://neo4j.com/terms/">Terms</a> | <a href="https://neo4j.com/privacy-policy/">Privacy </a> | <a href="https://neo4j.com/sitemap/">Sitemap</a></p>
    <p>Neo4j<sup></sup>, Neo Technology<sup></sup>, Cypher<sup></sup>, Neo4j<sup></sup> Bloom<sup></sup> and
      Neo4j<sup></sup> Aura<sup></sup> are registered trademarks
      of Neo4j, Inc. All other marks are owned by their respective companies.</p>
  </div>

  <div class="column">
    <h2><a href="https://neo4j.com/contact-us/?ref=footer">Contact Us </a></h2>
    <p>US: 1-855-636-4532<br>
      Sweden +46 171 480 113<br>
      UK: +44 20 3868 3223<br>
      France: +33 (0) 1 88 46 13 20<br>
      <!--Germany: +49 (0)89 26204 6300</p>-->
    </p>
  </div>
  <div class="column links">
    <h2>Learn</h2>
    <ul>
      <li><i class="fa fa-wrench" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/sandbox/?ref=developer-footer">Sandbox</a></li>
      <li><i class="fa fa-comments-o" aria-hidden="true"></i> <a rel="noopener" href="https://community.neo4j.com?ref=developer-footer" target="_blank">Neo4j Community Site</a></li>
      <li><i class="fa fa-book" aria-hidden="true"></i> <a rel="noopener" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a></li>
      <li><i class="fa fa-youtube" aria-hidden="true"></i> <a rel="noopener" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a></li>
      <li><i class="fa fa-graduation-cap" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/graphacademy/?ref=developer-footer">GraphAcademy</a></li>
      <li><i class="fa fa-flask" aria-hidden="true"></i> <a href="https://neo4j.com/labs/?ref=developer-footer">Neo4j Labs</a></li>
    </ul>
  </div>
  <div class="column links">
    <h2>Social</h2>
    <ul>
      <li><i class="fa fa-twitter" aria-hidden="true"></i> <a rel="noopener" href="https://twitter.com/neo4j" target="_blank">Twitter</a></li>
      <li><i class="fa fa-meetup" aria-hidden="true"></i> <a rel="noopener" href="https://www.meetup.com/Neo4j-Online-Meetup/" target="_blank">Meetups</a></li>
      <li><i class="fa fa-github" aria-hidden="true"></i> <a rel="noopener" href="https://github.com/neo4j/neo4j" target="_blank">Github</a></li>
      <li><i class="fa fa-stack-overflow" aria-hidden="true"></i> <a rel="noopener" href="https://stackoverflow.com/questions/tagged/neo4j" target="_blank">Stack Overflow</a></li>

      <li class="speaker-program"><a href="https://docs.google.com/forms/d/e/1FAIpQLSdEcNnMruES5iwvOVYovmS1D_P1ZL_HdUOitFrwrvruv5PZvA/viewform">Want to Speak?</a></li>
    </ul>
  </div>
</div>
</footer>

  <script src="../../../assets/js/vendor/auth0.js"></script>
  <script src="../../../assets/js/site.js"></script>
  <script async src="../../../assets/js/vendor/highlight.js"></script>
  <script async src="../../../assets/js/vendor/image-zoom.js"></script>

<script src="https://cdn.jsdelivr.net/npm/neo4j-driver@4.2.2/lib/browser/neo4j-web.min.js"></script>

<div id="neo4j-algolia-search-v2"></div>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.js"></script>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/polyfill.js"></script>
<script>window.algoliaSearchOptions = {indexName: "docs",placeholder: "Search Documentation",template: "docs"}</script>  </body>
</html>
