<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=5, minimum-scale=1">
    <meta name="msvalidate.01" content="B5163518CBE4A854B63801277FE5E35C" />
    <meta name="google-site-verification" content="ucqagxjVuq0lJZeLKs0F5AppzK111lNt3IoxU6mzlJE" />
    <meta name="robots" content="index, follow" />
    <meta name="googlebot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />
    <meta name="bingbot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />

    <meta property="og:locale" content="en_US" />
    <meta property="og:type" content="article" />

<script>(function(w,d,s,l,i){w[l]=w[l]||[];w[l].push({'gtm.start':new Date().getTime(),event:'gtm.js'});var f=d.getElementsByTagName(s)[0],j=d.createElement(s),dl=l!='dataLayer'?'&l='+l:'';j.async=true;j.src='https://www.googletagmanager.com/gtm.js?id='+i+dl;f.parentNode.insertBefore(j,f);})(window,document,'script','dataLayer','GTM-WK23PSS');</script>
<!-- Hotjar Tracking Code for staging -->
<script>
    (function(h,o,t,j,a,r){
        h.hj=h.hj||function(){(h.hj.q=h.hj.q||[]).push(arguments)};
        h._hjSettings={hjid:3587741,hjsv:6};
        a=o.getElementsByTagName('head')[0];
        r=o.createElement('script');r.async=1;
        r.src=t+h._hjSettings.hjid+j+h._hjSettings.hjsv;
        a.appendChild(r);
    })(window,document,'https://static.hotjar.com/c/hotjar-','.js?sv=');
</script>
<!-- End Hotjar Tracking code -->
    <title>Getting the correct results - Getting Started</title>
    <link rel="prev" href="../patterns-in-practice/">
    <link rel="next" href="../updating/">
      <meta name="description" content="This section describes how to manipulate the output of Cypher queries in order to get the results you are looking for.">
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.css" />
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/utilities.min.css" />

    <link rel="preload" href="../../../assets/fonts/fontawesome-webfont.woff2?v=4.7.0" as="font">
    <link rel="stylesheet" href="../../../assets/css/site.css">
    <link href="https://fonts.googleapis.com/css2?family=Nunito+Sans:wght@300;400;600;700&display=swap" rel="stylesheet">

    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />



    <meta property="neo:type" content="Docs">
    <meta property="neo:site" content="Reference Docs">


    <meta property="og:site_name" content="Neo4j Graph Data Platform" />
    <meta property="article:publisher" content="https://www.facebook.com/neo4j.graph.database" />
    <meta name="twitter:card" content="summary_large_image" />
    <meta name="twitter:creator" content="@neo4j" />
    <meta name="twitter:site" content="@neo4j" />
    <meta property="og:type" content="article" />
    <meta property="og:title" content="Getting the correct results - Getting Started" />
    <meta property="og:locale" content="en_US" />
    <meta property="og:image" content="https://dist.neo4j.com/wp-content/uploads/20210423062553/neo4j-social-share-21.png" />
    <meta property="og:description" content="This section describes how to manipulate the output of Cypher queries in order to get the results you are looking for." />
    <meta property="og:url" content="https://neo4j.com/docs/getting-started/cypher-intro/results/" />
    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />
  </head>
  <body class="article docs">
<!-- Google Tag Manager (noscript) -->
<noscript><iframe src="https://www.googletagmanager.com/ns.html?id=GTM-WK23PSS"
height="0" width="0" style="display:none;visibility:hidden"></iframe></noscript>
<!-- End Google Tag Manager (noscript) -->
<script>(function(f,b){if(!b.__SV){var e,g,i,h;window.mixpanel=b;b._i=[];b.init=function(e,f,c){function g(a,d){var b=d.split(".");2==b.length&&(a=a[b[0]],d=b[1]);a[d]=function(){a.push([d].concat(Array.prototype.slice.call(arguments,0)))}}var a=b;"undefined"!==typeof c?a=b[c]=[]:c="mixpanel";a.people=a.people||[];a.toString=function(a){var d="mixpanel";"mixpanel"!==c&&(d+="."+c);a||(d+=" (stub)");return d};a.people.toString=function(){return a.toString(1)+".people (stub)"};i="disable time_event track track_pageview track_links track_forms track_with_groups add_group set_group remove_group register register_once alias unregister identify name_tag set_config reset opt_in_tracking opt_out_tracking has_opted_in_tracking has_opted_out_tracking clear_opt_in_out_tracking start_batch_senders people.set people.set_once people.unset people.increment people.append people.union people.track_charge people.clear_charges people.delete_user people.remove".split(" ");
for(h=0;h<i.length;h++)g(a,i[h]);var j="set set_once union unset remove delete".split(" ");a.get_group=function(){function b(c){d[c]=function(){call2_args=arguments;call2=[c].concat(Array.prototype.slice.call(call2_args,0));a.push([e,call2])}}for(var d={},e=["get_group"].concat(Array.prototype.slice.call(arguments,0)),c=0;c<j.length;c++)b(j[c]);return d};b._i.push([e,f,c])};b.__SV=1.2;e=f.createElement("script");e.type="text/javascript";e.async=!0;e.src="undefined"!==typeof MIXPANEL_CUSTOM_LIB_URL?
MIXPANEL_CUSTOM_LIB_URL:"file:"===f.location.protocol&&"//cdn.mxpnl.com/libs/mixpanel-2-latest.min.js".match(/^\/\//)?"https://cdn.mxpnl.com/libs/mixpanel-2-latest.min.js":"//cdn.mxpnl.com/libs/mixpanel-2-latest.min.js";g=f.getElementsByTagName("script")[0];g.parentNode.insertBefore(e,g)}})(document,window.mixpanel||[]);
mixpanel.init("4bfb2414ab973c741b6f067bf06d5575", {batch_requests: true})
mixpanel.track("Page View", {
    pathname: window.location.origin + window.location.pathname,
    search: window.location.search,
    hash: window.location.hash,
    referrer: document.referrer,
})
</script>
<header class="header">
  <nav class="navbar">
    <div class="navbar-brand">
      <a class="navbar-item" href="/">

      <img class="navbar-logo" src="https://dist.neo4j.com/wp-content/uploads/20210422142941/neo4j-logo-2020.svg" alt="Neo4j Docs" />
      <a href="/docs/" class="navbar-item no-left-padding" aria-label="Docs">
        Docs
      </a>

      </div>

      <button class="navbar-search search-button" data-target="topbar-nav" id="search_open_mobile" aria-label="Open Search">
        <svg width="23px" height="23px" viewBox="0 0 23 23" version="1.1" class="fill-current float-right" id="searchx" role="button" title="Search Website">
          <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
            stroke-linejoin="round">
            <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
              <circle
                transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                cx="11.3893642" cy="11.3885639" r="8.056"></circle>
              <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
            </g>
          </g>
        </svg>
      </button>
      <button class="navbar-burger" data-target="topbar-nav" aria-label="Mobile Navigation Button">
        <span></span>
        <span></span>
        <span></span>
      </button>
    </div>
    <div id="topbar-nav" class="navbar-menu">
            <div class="navbar-end">


        <div class="navbar-item has-dropdown is-hoverable docs">
          <a class="navbar-link" href="/docs/">Docs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <span class="project-name">Neo4j DBMS</span>
              <ul class="project-links">
                <li><a href="/docs/getting-started/current/" class="project-link">Getting Started</a></li>
                <li><a href="/docs/operations-manual/current/" class="project-link">Operations</a></li>
                <li><a href="/docs/migration-guide/current/" class="project-link">Migration and Upgrade</a></li>
                <li><a href="/docs/status-codes/current/" class="project-link">Status Codes</a></li>
                <li><a href="/docs/java-reference/current/" class="project-link">Java Reference</a></li>
                <li><a href="/docs/kerberos-add-on/current/" class="project-link">Kerberos Add-on</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="/docs/aura/">Neo4j Aura</a>
              <ul class="project-links">
                <li><a class="project-link" href="/docs/aura">Neo4j Aura</a></li>
                <li><a class="project-link" href="/docs/aura/auradb/">Neo4j AuraDB</a></li>
                <li><a class="project-link" href="/docs/aura/aurads/">Neo4j AuraDS</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Tools</span>
              <ul class="project-links">
                <li><a href="/docs/bloom-user-guide/current/" class="project-link">Neo4j Bloom</a></li>
                <li><a href="/docs/browser-manual/current/" class="project-link">Neo4j Browser</a></li>
                <li><a href="/docs/data-importer/current/" class="project-link">Neo4j Data Importer</a></li>
                <li><a href="/docs/desktop-manual/current/" class="project-link">Neo4j Desktop</a></li>
                <li><a href="/docs/ops-manager/current/" class="project-link">Neo4j Ops Manager</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Graph Data Science</span>
              <ul class="project-links">
                <li><a href="/docs/graph-data-science/current/" class="project-link">Neo4j Graph Data Science Library</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Cypher Query Language</span>
              <ul class="project-links">
                <li><a href="/docs/cypher-manual/current/" class="project-link">Cypher</a></li>
                <li><a href="/docs/cypher-cheat-sheet/current/" class="project-link">Cypher Cheat Sheet</a></li>
                <li><a href="/docs/apoc/current/" class="project-link">APOC Library</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name" href="/docs/drivers-apis">Create applications</span>
              <ul class="project-links">
                <li><a href="/docs/python-manual/current/" class="project-link">Python Driver</a></li>
                <li><a href="/docs/go-manual/current/" class="project-link">Go Driver</a></li>
                <li><a href="/docs/java-manual/current/" class="project-link">Java Driver</a></li>
                <li><a href="/docs/javascript-manual/current/" class="project-link">JavaScript Driver</a></li>
                <li><a href="/docs/dotnet-manual/current/" class="project-link">.Net Driver</a></li>
                <li><a href="/docs/graphql-manual/current/" class="project-link">Neo4j GraphQL Library</a></li>
                <li><a href="/docs/http-api/current/" class="project-link">HTTP API</a></li>
                <li><a href="/docs/ogm-manual/current/" class="project-link">OGM Library</a></li>
                <li><a href="https://docs.spring.io/spring-data/neo4j/docs/current/reference/html/#reference" class="project-link">Spring Data Neo4j</a></li>
                <li><a href="/docs/spark/" class="project-link">Neo4j Connector for Apache Spark</a></li>
                <li><a href="/docs/kafka/" class="project-link">Neo4j Connector for Apache Kafka</a></li>
              </ul>
            </div>

          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable labs">
          <a class="navbar-link" href="/labs/">Labs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="/labs/arrows/">arrows.app</a>
              <ul class="project-links">
                <li><a href="/labs/arrows/" class="project-link">Details</a></li>
                <li><a href="https://arrows.app" class="project-link">arrows.app</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/apoc/">APOC Extended</a>

              <ul class="project-links">
                <li><a href="/labs/apoc/5/" class="project-link">Documentation</a></li>
                <li><a href="/developer/neo4j-apoc/" class="project-link">Developer Guide</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/halin/">Halin</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/etl-tool/">ETL Tool</a>
              <ul class="project-links">
                <li><a href="/labs/etl-tool/" class="project-link">Details</a></li>
                <li><a href="/labs/etl-tool/1.5.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neo4j-migrations/">Neo4j Migrations</a>
              <ul class="project-links">
                <li><a href="/labs/neo4j-migrations/" class="project-link">Details</a></li>
                <li><a href="/labs/neo4j-migrations/2.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/liquibase/">Neo4j Plugin For Liquibase</a>
              <ul class="project-links">
                <li><a href="/labs/liquibase/" class="project-link">Details</a></li>
                <li><a href="https://github.com/liquibase/liquibase-neo4j" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neosemantics/">Neosemantics</a>
              <ul class="project-links">
                <li><a href="/labs/neosemantics/tutorial/" class="project-link">Getting Started</a></li>
                <li><a href="/labs/neosemantics/4.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neo4j-helm/">Neo4j Helm</a>
              <ul class="project-links">
                <li><a href="/labs/neo4j-helm/" class="project-link">Details</a></li>
                <li><a href="/labs/neo4j-helm/1.0.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neodash/">NeoDash</a>
              <ul class="project-links">
                <li><a href="/labs/neodash/" class="project-link">Details</a></li>
                <li><a href="/labs/neodash/2.1/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neomodel/">neomodel</a>
              <ul class="project-links">
                <li><a href="/labs/neomodel/" class="project-link">Details</a></li>
                <li><a href="https://neomodel.readthedocs.io/en/latest/" target="_blank" class="project-link">Documentation</a></li>
              </ul>
            </div>
          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable developer">
          <a class="navbar-link" href="/developer/resources/">Get Help</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="https://graphacademy.neo4j.com/?ref=docs" target="_blank">GraphAcademy</a>
              <ul class="project-links">
                <li><a class="project-link" href="https://graphacademy.neo4j.com/?ref=docs">Free, Self Paced Training</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/certification/?ref=docs" target="_blank">Certification</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/forum" target="_blank">Community Forum</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/chat" target="_blank">Discord Chat</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/developer/kb" target="_blank">Knowledge Base</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a>
            </div>
          </div>
        </div>
        <div class="navbar-item is-hoverable getting-started-cta">
          <a class="navbar-link primary" href="https://neo4j.com/cloud/platform/aura-graph-database/?ref=docs-nav-get-started">Get Started Free</a>
        </div>
        <div class="navbar-item">
          <a class="navbar-link search-button" href="#search" id="search_open"><svg width="23px" height="23px" viewBox="0 0 23 23"
              version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"
              class="fill-current float-right" id="search" role="button" title="Search Website">
              <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
                stroke-linejoin="round">
                <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
                  <circle
                    transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                    cx="11.3893642" cy="11.3885639" r="8.056"></circle>
                  <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
                </g>
              </g>
            </svg><span class="navbar-mobile">Search</span></a>
        </div>
      </div>
    </div>
  </nav>
</header>
<div class="body">
<div class="nav-container" data-component="getting-started" data-version="">
  <aside class="nav">
    <div class="panels">
      <div class="selectors">
        
      </div>
      <div class="nav-panel-menu is-active" data-panel="menu">
    <nav class="nav-menu">
    <ul class="nav-list">
  <li class="nav-item" data-depth="0">
<ul class="nav-list">
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../">Welcome to Neo4j</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../get-started-with-neo4j/">Get started with Neo4j</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../get-started-with-neo4j/graph-database/">What is a graph database?</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../data-modeling/">Model your data for Neo4j</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-modeling/guide-data-modeling/">Graph modeling guidelines</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-modeling/modeling-designs/">Modeling designs</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-modeling/relational-to-graph-modeling/">Modeling: relational to graph</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-modeling/modeling-tips/">Graph modeling tips</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-modeling/graph-model-refactoring/">Graph model refactoring</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-modeling/data-modeling-tools/">Data modeling tools</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../data-import/">Import your data into Neo4j</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-import/csv-import/">Importing CSV data into Neo4j</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-import/json-rest-api-import/">Importing JSON data from a REST API into Neo4j</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../data-import/relational-to-graph-import/">Import: RDBMS to graph</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../">Query a Neo4j database</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../cypher-sql/">Comparing Cypher with SQL</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../patterns/">Patterns</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../patterns-in-practice/">Patterns in practice</a>
  </li>
  <li class="nav-item is-current-page" data-depth="2">
    <a class="nav-link" href="./">Getting the correct results</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../updating/">Updating the data</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../large-statements/">Composing large statements</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../subqueries/">Subqueries in Cypher</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../schema/">Defining a schema</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../dates-datetimes-durations/">Dates, datetimes, and durations</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../procedures-functions/">How to extend Cypher</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../load-csv/">Tutorial: Import data</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../resources/">Cypher resources</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../languages-guides/">Connect to Neo4j</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link nav-item-toggle" href="../../languages-guides/java/java-intro/">Using Neo4j from Java</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../languages-guides/java/spring-data-neo4j/">Spring Data Neo4j</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../languages-guides/java/quarkus/">Quarkus</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../languages-guides/java/java-frameworks/">Helidon, Micronaut</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../languages-guides/java/neo4j-ogm/">Neo4j - OGM Object Graph Mapper</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../languages-guides/java/java-procedures/">Procedures and Functions</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../languages-guides/neo4j-dotnet/">Using Neo4j from .NET</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../languages-guides/neo4j-javascript/">Neo4j from JavaScript</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../languages-guides/neo4j-python/">Using Neo4j from Python</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../languages-guides/neo4j-go/">Using Neo4j from Go</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../languages-guides/integration-tools/integration/">Neo4j Connectors</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../languages-guides/community-drivers/">Community-contributed libraries</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../gds/">Data science with Neo4j</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../graph-visualization/graph-visualization/">Visualize your data in Neo4j</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../graph-visualization/graph-visualization-tools/">Graph visualization tools</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../appendix/">Appendix</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link nav-item-toggle" href="../../appendix/graphdb-concepts/">Graph database concepts</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../appendix/graphdb-concepts/graphdb-vs-rdbms/">Transition from relational to graph database</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../appendix/graphdb-concepts/graphdb-vs-nosql/">Transition from NoSQL to graph database</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../appendix/example-data/">Example datasets</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../appendix/getting-started-resources/">Getting started resources</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link nav-item-toggle" href="../../appendix/tutorials/tutorials-overview/">Tutorials</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../appendix/tutorials/guide-cypher-basics/">Tutorial: Getting Started with Cypher</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../appendix/tutorials/guide-build-a-recommendation-engine/">Tutorial: Build a Cypher Recommendation Engine</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../appendix/tutorials/guide-import-relational-and-etl/">Tutorial: Import data from a relational database into Neo4j</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../appendix/tutorials/guide-import-desktop-csv/">How-To: Import CSV data with Neo4j Desktop</a>
  </li>
</ul>
  </li>
</ul>
  </li>
</ul>
  </li>
</ul>
  </nav>
</div>
    </div>
  </aside>
</div>
<main class="article">
<div class="toolbar" role="navigation">
  <div class="toolbar-wrapper">
    <button class="nav-toggle" aria-label="Toggle Table of Contents"></button>
    <a href="../../" class="home-link" aria-label="Go to home page"></a>
    <nav class="breadcrumbs" aria-label="breadcrumbs">
  <ul>
    <li><a href="../../">Getting Started</a></li>
    <li><a href="../">
        Query a Neo4j database
    </a></li>
    <li><a href="./">
        Getting the correct results
    </a></li>
  </ul>
</nav>
        <div class="edit-this-page"><a href="https://github.com/neo4j/docs-getting-started/tree/HEAD/modules/ROOT/pages/cypher-intro/results.adoc">Edit this Page</a></div>
    </div>
</div>

  <div class="content">
<article class="doc">
<div class="sect-header">
<h1 class="page">Getting the correct results</h1>
</div>





<div class="sect1">
<h2 id="cypher-intro-results-example-graph"><a class="anchor" href="#cypher-intro-results-example-graph"></a>Example graphs</h2>
<div class="sectionbody">
<div class="paragraph">
<p>In this section, two example datasets are used.
The first graph is based on the Movie database.
The following code block helps you to create the data for exploring Cypher<sup>&reg;</sup> queries:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CREATE (matrix:Movie {title: 'The Matrix', released: 1997})
CREATE (cloudAtlas:Movie {title: 'Cloud Atlas', released: 2012})
CREATE (forrestGump:Movie {title: 'Forrest Gump', released: 1994})
CREATE (keanu:Person {name: 'Keanu Reeves', born: 1964})
CREATE (robert:Person {name: 'Robert Zemeckis', born: 1951})
CREATE (tom:Person {name: 'Tom Hanks', born: 1956})
CREATE (tom)-[:ACTED_IN {roles: ['Forrest']}]-&gt;(forrestGump)
CREATE (tom)-[:ACTED_IN {roles: ['Zachry']}]-&gt;(cloudAtlas)
CREATE (robert)-[:DIRECTED]-&gt;(forrestGump)</code></pre>
</div>
</div>
<div class="paragraph">
<p>This is the resulting graph:</p>
</div>
<div class="imageblock middle">
<div class="content">
<img src="../../_images/cypher-intro-results01-arr.svg" alt="cypher intro results01 arr" width="500">
</div>
</div>
<div class="paragraph">
<p>The second dataset is a small network of people, companies they work for, and technologies they like.
You can find its image in the <a href="#filter-ranges">following chapter</a>.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-results-filtering"><a class="anchor" href="#cypher-intro-results-filtering"></a>Filtering results</h2>
<div class="sectionbody">
<div class="paragraph">
<p>So far you have matched patterns in the graph and always returned all results you found.
Now let&#8217;s look into options for filtering the results and only return the subset of data that you are interested in.
Those filter conditions are expressed using the <code>WHERE</code> clause.
This clause allows to use any number of boolean expressions, <em>predicates</em>, combined with <code>AND</code>, <code>OR</code>, <code>XOR</code> and <code>NOT</code>.
The simplest predicates are comparisons; especially equality.</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Movie)
WHERE m.title = 'The Matrix'
RETURN m</code></pre>
</div>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 1

+------------------------------------------------+
| m                                              |
+------------------------------------------------+
| (:Movie {title: 'The Matrix', released: 1997}) |
+------------------------------------------------+</pre>
</div>
</div>
<div class="admonitionblock tip">
<table>
<tr>
<td class="icon">
<i class="fa icon-tip" title="Tip"></i>
</td>
<td class="content">
<div class="paragraph">
<p>The query above, using the <code>WHERE</code> clause, is equivalent to this query which includes the condition in the pattern matching:</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Movie {title: 'The Matrix'})
RETURN m</code></pre>
</div>
</div>
<div class="paragraph">
<p>Cypher is designed to be flexible, so there is often more than one way to write a query.</p>
</div>
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>Other options are numeric comparisons, matching regular expressions, and checking the existence of values within a list.</p>
</div>
<div class="paragraph">
<p>The <code>WHERE</code> clause in the following example includes a regular expression match, a greater-than comparison, and a test to see if a value exists in a list:</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person)-[r:ACTED_IN]-&gt;(m:Movie)
WHERE p.name =~ 'K.+' OR m.released &gt; 2000 OR 'Neo' IN r.roles
RETURN p, r, m</code></pre>
</div>
</div>
<div class="paragraph">
<p>Based on the given logical operator <code>OR</code> and the graph pattern <code>(p:Person)-[r:ACTED_IN]&#8594;(m:Movie)</code>, the query result has to meet <strong>one</strong> of the following requirements:</p>
</div>
<div class="ulist">
<ul>
<li>
<p>The person&#8217;s <code>name</code> starts with the letter <code>'K'</code>.</p>
</li>
<li>
<p>The movie was released after the year <code>2000</code>.</p>
</li>
<li>
<p>The role is <code>'Neo'</code>.</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>In our case, only the second condition matches the graph pattern <code>(p:Person)-[r:ACTED_IN]&#8594;(m:Movie)</code>, therefore the output is the following:</p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 1

+-------------------------------------------------------------------------------------------------------------------------------+
| p                                         | r                               | m                                               |
+-------------------------------------------------------------------------------------------------------------------------------+
| (:Person {name: 'Tom Hanks', born: 1956}) | [:ACTED_IN {roles: ['Zachry']}] | (:Movie {title: 'Cloud Atlas', released: 2012}) |
+-------------------------------------------------------------------------------------------------------------------------------+</pre>
</div>
</div>
<div class="paragraph">
<p>An advanced aspect is that patterns can be used as predicates.
Where <code>MATCH</code> expands the number and shape of patterns matched, a pattern predicate restricts the current result set.
It only allows the paths to pass that satisfy the specified pattern.
As you can expect, the use of <code>NOT</code> only allows the paths to pass that do <em>not</em> satisfy the specified pattern.</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person)-[:ACTED_IN]-&gt;(m)
WHERE NOT (p)-[:DIRECTED]-&gt;()
RETURN p, m</code></pre>
</div>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 2

+----------------------------------------------------------------------------------------------+
| p                                         | m                                                |
+----------------------------------------------------------------------------------------------+
| (:Person {name: 'Tom Hanks', born: 1956}) | (:Movie {title: 'Cloud Atlas', released: 2012})  |
| (:Person {name: 'Tom Hanks', born: 1956}) | (:Movie {title: 'Forrest Gump', released: 1994}) |
+----------------------------------------------------------------------------------------------+</pre>
</div>
</div>
<div class="paragraph">
<p>Here you are able to find actors because they sport an <code>ACTED_IN</code> relationship but then skip those that ever <code>DIRECTED</code> any movie.</p>
</div>
<div class="paragraph">
<p>There are more advanced ways of filtering, for example <em>list predicates</em>, which will be discussed later in this section.</p>
</div>
<div class="sect2">
<h3 id="filter-ranges"><a class="anchor" href="#filter-ranges"></a>Querying ranges of values</h3>
<div class="paragraph">
<p>There are frequent queries where you want to look for data within a certain range.
Date or number ranges can be used to check for events within a certain timeline, age values, or other uses.</p>
</div>
<div class="paragraph">
<p>The syntax for this criteria is very similar to SQL and other programming language logic structures for checking ranges of values.</p>
</div>
<div class="paragraph">
<p>The following dataset is used to demonstrate the Cypher queries for these cases.</p>
</div>
<div id="people-technologies-companies" class="imageblock popup-link">
<div class="content">
<img src="../../_images/people-companies-technologies-rel-property.svg" alt="people companies technologies rel property">
</div>
</div>
<div class="paragraph">
<p>To reproduce the dataset, run the following Cypher query:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CREATE (diana:Person {name: "Diana"})
CREATE (melissa:Person {name: "Melissa", twitter: "@melissa"})
CREATE (dan:Person {name: "Dan", twitter: "@dan", yearsExperience: 6})
CREATE (sally:Person {name: "Sally", yearsExperience: 4})
CREATE (john:Person {name: "John", yearsExperience: 5})
CREATE (jennifer:Person {name: "Jennifer", twitter: "@jennifer", yearsExperience: 5})
CREATE (joe:Person {name: "Joe"})
CREATE (mark:Person {name: "Mark", twitter: "@mark"})
CREATE (ann:Person {name: "Ann"})
CREATE (xyz:Company {name: "XYZ"})
CREATE (x:Company {name: "Company X"})
CREATE (a:Company {name: "Company A"})
CREATE (Neo4j:Company {name: "Neo4j"})
CREATE (abc:Company {name: "ABC"})
CREATE (query:Technology {type: "Query Languages"})
CREATE (etl:Technology {type: "Data ETL"})
CREATE (integrations:Technology {type: "Integrations"})
CREATE (graphs:Technology {type: "Graphs"})
CREATE (dev:Technology {type: "Application Development"})
CREATE (java:Technology {type: "Java"})
CREATE (diana)-[:LIKES]-&gt;(query)
CREATE (melissa)-[:LIKES]-&gt;(query)
CREATE (dan)-[:LIKES]-&gt;(etl)&lt;-[:LIKES]-(melissa)
CREATE (xyz)&lt;-[:WORKS_FOR]-(sally)-[:LIKES]-&gt;(integrations)&lt;-[:LIKES]-(dan)
CREATE (sally)&lt;-[:IS_FRIENDS_WITH]-(john)-[:LIKES]-&gt;(java)
CREATE (john)&lt;-[:IS_FRIENDS_WITH]-(jennifer)-[:LIKES]-&gt;(java)
CREATE (john)-[:WORKS_FOR]-&gt;(xyz)
CREATE (sally)&lt;-[:IS_FRIENDS_WITH]-(jennifer)-[:IS_FRIENDS_WITH]-&gt;(melissa)
CREATE (joe)-[:LIKES]-&gt;(query)
CREATE (x)&lt;-[:WORKS_FOR]-(diana)&lt;-[:IS_FRIENDS_WITH]-(joe)-[:IS_FRIENDS_WITH]-&gt;(mark)-[:LIKES]-&gt;(graphs)&lt;-[:LIKES]-(jennifer)-[:WORKS_FOR {startYear: 2017}]-&gt;(Neo4j)
CREATE (ann)&lt;-[:IS_FRIENDS_WITH]-(jennifer)-[:IS_FRIENDS_WITH]-&gt;(mark)
CREATE (john)-[:LIKES]-&gt;(dev)&lt;-[:LIKES]-(ann)-[:IS_FRIENDS_WITH]-&gt;(dan)-[:WORKS_FOR]-&gt;(abc)
CREATE (ann)-[:WORKS_FOR]-&gt;(abc)
CREATE (a)&lt;-[:WORKS_FOR]-(melissa)-[:LIKES]-&gt;(graphs)&lt;-[:LIKES]-(diana)</code></pre>
</div>
</div>
<div class="paragraph">
<p>Imagine, you would like to know who possesses experience ranging from three to seven years.
The code block below shows the Cypher query for this case.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person)
WHERE 3 &lt;= p.yearsExperience &lt;= 7
RETURN p</code></pre>
</div>
</div>
<div class="imageblock popup-link">
<div class="content">
<img src="../../_images/cypher-filter-ranges-arr.svg" alt="cypher filter ranges arr" width="500">
</div>
</div>
</div>
<div class="sect2">
<h3 id="filter-exists"><a class="anchor" href="#filter-exists"></a>Testing if a property exists</h3>
<div class="paragraph">
<p>You may only be interested if a property exists on a node or relationship.
For instance, you might want to check which customers in your system have Twitter handles, so you can show relevant content.
Or, you could check if all of your employees have a start date property to verify which entities might need to be updated.</p>
</div>
<div class="admonitionblock important">
<table>
<tr>
<td class="icon">
<i class="fa icon-important" title="Important"></i>
</td>
<td class="content">
<div class="paragraph">
<p>Remember: in Neo4j, a property only exists (is stored) if it has a value.
A <code>null</code> property is not stored.
This ensures that only valuable, necessary information is retained for your nodes and relationships.</p>
</div>
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>To write this type of existence check in <strong>Neo4j v5</strong>, you need to use the <code>IS NOT NULL</code> predicate to only include nodes or relationships in which a property exists.</p>
</div>
<div class="paragraph">
<p>The Cypher code is written in the block below.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//Query1: find all users who have a twitter property
MATCH (p:Person)
WHERE p.twitter IS NOT NULL
RETURN p.name;

//Query2: find all WORKS_FOR relationships that have a startYear property
MATCH (p:Person)-[rel:WORKS_FOR]-&gt;(c:Company)
WHERE rel.startYear IS NOT NULL
RETURN p, rel, c;</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Query1 results:</strong></p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 4

+------------------------+
| p.name                 |
+------------------------+
| 'Melissa'              |
| 'Dan'                  |
| 'Jennifer'             |
| 'Mark'                 |
+---------- -------------+</pre>
</div>
</div>
<div class="paragraph">
<div class="title">Query2 results:</div>
<p><span class="image popup-link"><img src="../../_images/cypher-filter-exists-relProp-arr.svg" alt="cypher filter exists relProp arr" width="400"></span></p>
</div>
</div>
<div class="sect2">
<h3 id="filter-strings"><a class="anchor" href="#filter-strings"></a>Checking strings&#8201;&#8212;&#8201;partial values, fuzzy searches</h3>
<div class="paragraph">
<p>Some scenarios require query syntax that matches on partial values or broad categories within a string.
To do this kind of query, you need some flexibility and options for string matching and searches.
Whether you are looking for a string that starts with, ends with, or includes a certain value, Cypher offers the ability to handle it performantly and easily.</p>
</div>
<div class="paragraph">
<p>There are a few keywords in Cypher used with the <code>WHERE</code> clause to test string property values.
The <code>STARTS WITH</code> keyword allows you check the value of a property that begins with the string you specify.
With the <code>CONTAINS</code> keyword, you can check if a specified string is part of a property value.
The <code>ENDS_WITH</code> keyword checks the end of the property string for the value you specify.</p>
</div>
<div class="paragraph">
<p>An example of each is in the following Cypher block.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//check if a property starts with 'M'
MATCH (p:Person)
WHERE p.name STARTS WITH 'M'
RETURN p.name;

//check if a property contains 'a'
MATCH (p:Person)
WHERE p.name CONTAINS 'a'
RETURN p.name;

//check if a property ends with 'n'
MATCH (p:Person)
WHERE p.name ENDS WITH 'n'
RETURN p.name;</code></pre>
</div>
</div>
<div class="paragraph">
<p>You can also use regular expressions to test the value of strings.
For example, you could look for all the <code>Person</code> nodes that share a first name or you could find all the classes with a certain department code.</p>
</div>
<div class="paragraph">
<p>Let&#8217;s look at an example.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person)
WHERE p.name =~ 'Jo.*'
RETURN p.name</code></pre>
</div>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 2

+--------------------------------+
| p.name                         |
+--------------------------------+
| 'John'                         |
| 'Joe'                          |
+--------------------------------+</pre>
</div>
</div>
<div class="paragraph">
<p>Just like in SQL and other languages, you can check if a property value is a value in a list.
The <code>IN</code> keyword allows you to specify an array of values and validate a property&#8217;s contents against each one in the list.</p>
</div>
<div class="paragraph">
<p>Here is an example:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person)
WHERE p.yearsExperience IN [1, 5, 6]
RETURN p.name, p.yearsExperience</code></pre>
</div>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 3

+--------------------------------+
| p.name      | p.yearsExp       |
+--------------------------------+
| 'Jennifer'  | 5                |
| 'Dan'       | 6                |
| 'John'      | 5                |
+--------------------------------+</pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="filter-patterns"><a class="anchor" href="#filter-patterns"></a>Filtering on patterns</h3>
<div class="paragraph">
<p>One thing that makes graph unique is its focus on relationships.
Just as you can filter queries based on node labels or properties, you can also filter results based on relationships or patterns.
This allows you to test if a pattern also has a certain relationship or does not, or if another pattern exists.</p>
</div>
<div class="paragraph">
<p>The following Cypher code shows how this is done.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//Query1: find which people are friends of someone who works for Neo4j
MATCH (p:Person)-[r:IS_FRIENDS_WITH]-&gt;(friend:Person)
WHERE exists((p)-[:WORKS_FOR]-&gt;(:Company {name: 'Neo4j'}))
RETURN p, r, friend;

//Query2: find Jennifer's friends who do not work for a company
MATCH (p:Person)-[r:IS_FRIENDS_WITH]-&gt;(friend:Person)
WHERE p.name = 'Jennifer'
AND NOT exists((friend)-[:WORKS_FOR]-&gt;(:Company))
RETURN friend.name;</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Query1 results:</strong>
<span class="image popup-link"><img src="../../_images/cypher-filter-exists-ptrn-arr.svg" alt="cypher filter exists ptrn arr" width="600"></span></p>
</div>
<div class="paragraph">
<p><strong>Query2 results:</strong></p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 1

+--------------------------------+
| friend.name                    |
+--------------------------------+
| 'Mark'                         |
+--------------------------------+</pre>
</div>
</div>
<div class="sect3">
<h4 id="filter-optional"><a class="anchor" href="#filter-optional"></a>Optional patterns</h4>
<div class="paragraph">
<p>There are cases where you might want to retrieve results from patterns, even if they do not match the entire pattern or all of the criteria.
This is how an outer join in SQL functions.
In Cypher, you can use an <code>OPTIONAL MATCH</code> pattern to try to match it, but if it doesn&#8217;t find results, those rows will return <code>null</code> for those values.</p>
</div>
<div class="paragraph">
<p>You can see how this would look in Cypher by querying for people whose name starts with a specific letter and who may work for a company.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//Find all people whose name starts with J and who may work for a company.
MATCH (p:Person)
WHERE p.name STARTS WITH 'J'
OPTIONAL MATCH (p)-[:WORKS_FOR]-(other:Company)
RETURN p.name, other.name;</code></pre>
</div>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 3

+--------------------------------+
| p.name      | other.name       |
+--------------------------------+
| 'Jennifer'  | 'Neo4j'          |
| 'John'      | 'XYZ'            |
| 'Joe'       | null             |
+--------------------------------+</pre>
</div>
</div>
<div class="paragraph">
<p>Notice that Joe is returned because his name starts with the letter 'J', but his company&#8217;s name is <code>null</code>.
That is because he does not have a <code>WORKS_FOR</code> relationship to a <code>COMPANY</code> node.
Since you used <code>OPTIONAL MATCH</code>, his <code>Person</code> node is still returned from the first match, but the second match is not found, so returns <code>null</code>.</p>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
<div class="paragraph">
<p>To see the difference, try running the query without the <code>OPTIONAL</code> in front of the second match.
You can see that Joe&#8217;s row is no longer returned.
That is because Cypher reads the statement with an <code>AND</code> match, so the person must match the first criteria (name starts with 'J') and the second criteria (person works for a company).</p>
</div>
</td>
</tr>
</table>
</div>
</div>
<div class="sect3">
<h4 id="filter-paths"><a class="anchor" href="#filter-paths"></a>More complex patterns</h4>
<div class="paragraph">
<p>You are able to handle many simple graph queries even at this point.
But what happens when you want to extend your patterns past a single relationship?
What if you want to know who else likes graphs besides Jennifer?</p>
</div>
<div class="paragraph">
<p>We handle this functionality and many others by simply adding on to our first pattern or matching additional patterns.
Let us look at a couple of examples.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//Query1: find who likes graphs besides Jennifer
MATCH (j:Person {name: 'Jennifer'})-[r:LIKES]-(graph:Technology {type: 'Graphs'})-[r2:LIKES]-(p:Person)
RETURN p.name;

//Query2: find who likes graphs besides Jennifer that she is also friends with
MATCH (j:Person {name: 'Jennifer'})-[:LIKES]-&gt;(:Technology {type: 'Graphs'})&lt;-[:LIKES]-(p:Person),
      (j)-[:IS_FRIENDS_WITH]-(p)
RETURN p.name;</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Query1 results:</strong></p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 3

+-----------------------+
| p.name                |
+-----------------------+
| 'Diana'               |
| 'Mark'                |
| 'Melissa'             |
+-----------------------+</pre>
</div>
</div>
<div class="paragraph">
<p><strong>Query2 results:</strong></p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 2

+-----------------------+
| p.name                |
+-----------------------+
| 'Mark'                |
| 'Melissa'             |
+-----------------------+</pre>
</div>
</div>
<div class="paragraph">
<p>Notice that on the second query a comma is used after the first <code>MATCH</code> line and another pattern is added to match on the next line.
This allows you to chain patterns together, similar to when you used the <code>WHERE exists(&lt;pattern&gt;)</code> syntax above.
With this structure, you can add multiple different patterns and link them together, allowing you to traverse various pieces of the graph with certain patterns.</p>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-results-returning"><a class="anchor" href="#cypher-intro-results-returning"></a>Returning results</h2>
<div class="sectionbody">
<div class="paragraph">
<p>So far, you have returned nodes, relationships, and paths directly via their variables.
However, the <code>RETURN</code> clause can return any number of expressions.
But what are expressions in Cypher?</p>
</div>
<div class="paragraph">
<p>The simplest expressions are literal values.
Examples of literal values are: numbers, strings, arrays (for example: <code>[1,2,3]</code>), and maps (for example: <code>{name: 'Tom Hanks', born:1964, movies: ['Forrest Gump', ...], count: 13}</code>).
Individual properties of any node, relationship or map can be accessed using the <em>dot syntax</em>, for example: <code>n.name</code>.
Individual elements or slices of arrays can be retrieved with subscripts, for example: <code>names[0]</code> and <code>movies[1..-1]</code>.
Each function evaluation, for example: <code>length(array)</code>, <code>toInteger('12')</code>, <code>substring('2014-07-01', 0, 4)</code> and <code>coalesce(p.nickname, 'n/a')</code>, is also an expression.</p>
</div>
<div class="paragraph">
<p>Predicates used in <code>WHERE</code> clauses count as <em>boolean expressions</em>.</p>
</div>
<div class="paragraph">
<p>Simple expressions can be composed and concatenated to form more complex expressions.</p>
</div>
<div class="paragraph">
<p>By default the expression itself is used as a label for the column, in many cases you want to alias that with a more understandable name using <code>expression AS alias</code>.
The alias can be used subsequently to refer to that column.</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person)
RETURN
  p,
  p.name AS name,
  toUpper(p.name),
  coalesce(p.nickname, 'n/a') AS nickname,
  {name: p.name, label: head(labels(p))} AS person</code></pre>
</div>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 3

+-------------------------------------------------------------------------------------------------------------------------------------------------+
| p                                               | name              | toUpper(p.name)   | nickname | person                                     |
+-------------------------------------------------------------------------------------------------------------------------------------------------+
| (:Person {name: 'Keanu Reeves', born: 1964})    | 'Keanu Reeves'    | 'KEANU REEVES'    | 'n/a'    | {name: 'Keanu Reeves', label: 'Person'}    |
| (:Person {name: 'Robert Zemeckis', born: 1951}) | 'Robert Zemeckis' | 'ROBERT ZEMECKIS' | 'n/a'    | {name: 'Robert Zemeckis', label: 'Person'} |
| (:Person {name: 'Tom Hanks', born: 1956})       | 'Tom Hanks'       | 'TOM HANKS'       | 'n/a'    | {name: 'Tom Hanks', label: 'Person'}       |
+-------------------------------------------------------------------------------------------------------------------------------------------------+</pre>
</div>
</div>
<div class="paragraph">
<p>If you wish to display only unique results you can use the <code>DISTINCT</code> keyword after <code>RETURN</code>:</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n)
RETURN DISTINCT labels(n) AS Labels</code></pre>
</div>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 2

+------------+
| Labels     |
+------------+
| ['Movie']  |
| ['Person'] |
+------------+</pre>
</div>
</div>
<div class="sect2">
<h3 id="cypher-intro-results-distinct"><a class="anchor" href="#cypher-intro-results-distinct"></a>Returning unique results</h3>
<div class="paragraph">
<p>You can return unique results using <code>DISTINCT</code> keyword in Cypher. Some of your queries may return duplicate results due to multiple paths to the node or a node that meets multiple criteria.
This redundancy can clutter results and make sifting through a long list difficult to find what you need.</p>
</div>
<div class="paragraph">
<p>To trim out duplicate entities, you can use the <code>DISTINCT</code> keyword.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//Query: find people who have a twitter and like graphs or query languages
MATCH (user:Person)
WHERE user.twitter IS NOT null
WITH user
MATCH (user)-[:LIKES]-(t:Technology)
WHERE t.type IN ['Graphs','Query Languages']
RETURN DISTINCT user.name</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Query results:</strong></p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 3

+-----------------------+
| user.name             |
+-----------------------+
| 'Jennifer'            |
| 'Melissa'             |
| 'Mark'                |
+-----------------------+</pre>
</div>
</div>
<div class="paragraph">
<p>For the preceding query, the use case is that you are launching a new Twitter account for tips and tricks on Cypher, and you want to notify users who have a Twitter account and who like graphs or query languages.
The first two lines of the query look for <code>Person</code> nodes that have a Twitter handle.
Then, you use <code>WITH</code> to pass those users over to the next <code>MATCH</code>, where you find out if the person likes graphs or query languages.
Notice that running this statement without the <code>DISTINCT</code> keyword results in 'Melissa' shown twice.
This is because she likes graphs and she also likes query languages.
When <code>DISTINCT</code> is used, you only retrieve unique users.</p>
</div>
</div>
<div class="sect2">
<h3 id="cypher-intro-results-limit"><a class="anchor" href="#cypher-intro-results-limit"></a>Limiting number of results</h3>
<div class="paragraph">
<p>There are times when you want a sampling set, or you only want to pull so many results to update or process at a time.
The <code>LIMIT</code> keyword takes the output of the query and limits the volume returned based on the number you specify.</p>
</div>
<div class="paragraph">
<p>For instance, you can find each person&#8217;s number of friends in our graph.
If the graph were thousands or millions of nodes and relationships, the number of results returned would be massive.
What if you only cared about the top three people who had the most friends?
Let&#8217;s write a query for that!</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//Query: find the top 3 people who have the most friends
MATCH (p:Person)-[r:IS_FRIENDS_WITH]-(other:Person)
RETURN p.name, count(other.name) AS numberOfFriends
ORDER BY numberOfFriends DESC
LIMIT 3</code></pre>
</div>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 3

+--------------------------------+
| p.name      | numberOfFriends  |
+--------------------------------+
| 'Jennifer'  | 5                |
| 'Mark'      | 2                |
| 'Ann'       | 2                |
+--------------------------------+</pre>
</div>
</div>
<div class="paragraph">
<p>The query pulls persons and the friends they are connected to and returns the person name and count of their friends.
You could run just that much of the query and return a messy list of names and friend counts, but you probably want to order the list based on the number of friends each person has starting with the biggest number at the top (<code>DESC</code>).
You could also run that much of the query to see the friends and counts all in order, but in the example above the top three people with the most friends have been pulled from the graph.
The <code>LIMIT</code> pulls the top results from the ordered list.</p>
</div>
<div class="admonitionblock tip">
<table>
<tr>
<td class="icon">
<i class="fa icon-tip" title="Tip"></i>
</td>
<td class="content">
<div class="paragraph">
<p>Try mixing up the query by removing the <code>ORDER BY</code> and <code>LIMIT</code> lines and then add each one separately.
Notice that only removing the <code>ORDER BY</code> line pulls the starting three values from the list, getting a random sampling of the return results.</p>
</div>
</td>
</tr>
</table>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-results-aggregating"><a class="anchor" href="#cypher-intro-results-aggregating"></a>Aggregating information</h2>
<div class="sectionbody">
<div class="paragraph">
<p>In many cases, we wish to aggregate or group the data encountered while traversing patterns in our graph.
In Cypher, aggregation happens in the <code>RETURN</code> clause while computing the final results.
Many common aggregation functions are supported, for example <code>count</code>, <code>sum</code>, <code>avg</code>, <code>min</code>, and <code>max</code>, but there are several more.</p>
</div>
<div class="paragraph">
<p>Counting the number of people in the Movie database could be achieved by this:</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (:Person)
RETURN count(*) AS people</code></pre>
</div>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 1

+--------+
| people |
+--------+
| 3      |
+--------+</pre>
</div>
</div>
<div class="paragraph">
<p>If you want to skip <code>null</code> values, use the function <code>count(variable)</code>.</p>
</div>
<div class="paragraph">
<p>For aggregating only unique values use the <code>DISTINCT</code> operator, for example: <code>count(DISTINCT role)</code>.</p>
</div>
<div class="paragraph">
<p>Aggregation works implicitly in Cypher.
You specify which result columns you wish to aggregate.
Cypher uses all non-aggregated columns as grouping keys.</p>
</div>
<div class="paragraph">
<p>Aggregation affects which data is still visible in ordering or later query parts.</p>
</div>
<div class="paragraph">
<p>The following statement finds out how often an actor and director have worked together:</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (actor:Person)-[:ACTED_IN]-&gt;(movie:Movie)&lt;-[:DIRECTED]-(director:Person)
RETURN actor, director, count(*) AS collaborations</code></pre>
</div>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 1

+--------------------------------------------------------------------------------------------------------------+
| actor                                     | director                                        | collaborations |
+--------------------------------------------------------------------------------------------------------------+
| (:Person {name: 'Tom Hanks', born: 1956}) | (:Person {name: 'Robert Zemeckis', born: 1951}) | 1              |
+--------------------------------------------------------------------------------------------------------------+</pre>
</div>
</div>
<div class="paragraph">
<p>There are three different ways to use the <code>count()</code> function:</p>
</div>
<div class="olist arabic">
<ol class="arabic">
<li>
<p><code>count(*)</code>: counts results and returns the number of matching rows.</p>
</li>
<li>
<p><code>count(n)</code>: counts the number of occurrences of <code>n</code> (excludes <code>null</code> values).
You can specify nodes, relationships, or properties within the parentheses for Cypher to count.</p>
</li>
<li>
<p><code>count(DISTINCT variable)</code>: the <code>DISTINCT</code> operator removes duplicates from the results.</p>
</li>
</ol>
</div>
<div class="paragraph">
<p>In the dataset <a href="#people-technologies-companies"><em>People, technologies, and companies</em></a>, some of the <code>Person</code> nodes have a Twitter handle, but others do not.
If you run the first example query below, you will see that the <code>twitter</code> property has a value for four people and is <code>null</code> for the other five people.
The second and third queries show how to use the different <code>count</code> options.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//Query1: see the list of Twitter handle values for Person nodes
MATCH (p:Person)
RETURN p.twitter;</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Query1 results:</strong></p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 9

+--------------+
| p.twitter    |
+--------------+
| '@jennifer'  |
| '@melissa'   |
| null         |
| '@mark'      |
| '@dan'       |
| null         |
| null         |
| null         |
| null         |
+--------------+</pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//Query2: count of the non-null `twitter` property of the Person nodes
MATCH (p:Person)
RETURN count(p.twitter);</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Query2 results:</strong></p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 1

+-------------------+
| count(p.twitter)  |
+-------------------+
| 4                 |
+-------------------+</pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//Query3: count on the Person nodes
MATCH (p:Person)
RETURN count(*);</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Query3 results:</strong></p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 1

+-------------------+
| count(*)          |
+-------------------+
| 9                 |
+-------------------+</pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-results-collecting-aggregation"><a class="anchor" href="#cypher-intro-results-collecting-aggregation"></a>Collecting aggregation</h2>
<div class="sectionbody">
<div class="paragraph">
<p>A very helpful aggregation function is <code>collect(expression)</code>, which returns a single aggregated list of the values returned by an expression.
This is very useful in many situations, since no information of details is lost while aggregating.</p>
</div>
<div class="paragraph">
<p><code>collect()</code> is well-suited for retrieving typical parent-child structures, where one core entity (<em>parent</em>, <em>root</em>, or <em>head</em>) is returned per row with all its dependent information in associated lists created with <code>collect()</code>.
This means that there is no need to repeat the parent information for each child row, or running <code>n+1</code> statements to retrieve the parent and its children individually.</p>
</div>
<div class="paragraph">
<p>The following statement could be used to retrieve the cast of each movie in our database:</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Movie)&lt;-[:ACTED_IN]-(a:Person)
RETURN m.title AS movie, collect(a.name) AS cast, count(*) AS actors</code></pre>
</div>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 2

+-----------------------------------------+
| movie          | cast          | actors |
+-----------------------------------------+
| 'Forrest Gump' | ['Tom Hanks'] | 1      |
| 'Cloud Atlas'  | ['Tom Hanks'] | 1      |
+-----------------------------------------+</pre>
</div>
</div>
<div class="paragraph">
<p>The lists created by <code>collect()</code> can either be used from the client consuming the Cypher results or directly within a statement with any of the list functions or predicates.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-results-unwind"><a class="anchor" href="#cypher-intro-results-unwind"></a>Looping through list values</h2>
<div class="sectionbody">
<div class="paragraph">
<p>If you have a list that you want to inspect or separate the values, Cypher offers the <code>UNWIND</code> clause.
This does the opposite of <code>collect()</code> and separates a list into individual values on separate rows.</p>
</div>
<div class="paragraph">
<p><code>UNWIND</code> is frequently used for looping through JSON and XML objects when importing data, as well as everyday arrays and other types of lists.
Let us look at a couple of examples where we assume that the technologies someone likes also mean they have some experience with each one.
If you are interested in hiring people who are familiar with <code>Graphs</code> or <code>Query Languages</code>, you can write the following query to find people to interview.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//Query1: for a list of techRequirements, look for people who have each skill
WITH ['Graphs','Query Languages'] AS techRequirements
UNWIND techRequirements AS technology
MATCH (p:Person)-[r:LIKES]-(t:Technology {type: technology})
RETURN t.type, collect(p.name) AS potentialCandidates;</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Query1 results:</strong></p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 2

+-------------------+------------------------------------------+
| t.type            | potentialCandidates                      |
+-------------------+------------------------------------------+
| 'Graphs'          | ['Diana', 'Mark', 'Melissa', 'Jennifer'] |
| 'Query Languages' | ['Diana', 'Melissa', 'Joe']              |
+-------------------+------------------------------------------+</pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//Query2: for numbers in a list, find candidates who have that many years of experience
WITH [4, 5, 6, 7] AS experienceRange
UNWIND experienceRange AS number
MATCH (p:Person)
WHERE p.yearsExp = number
RETURN p.name, p.yearsExp;</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Query2 results:</strong></p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 4

+--------------+-----------------+
| p.name       | p.yearsExp      |
+--------------+-----------------+
| 'Sally'      | 4               |
| 'Jennifer'   | 5               |
| 'John'       | 5               |
| 'Dan'        | 6               |
+--------------+-----------------+</pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-intro-results-ordering-and-pagination"><a class="anchor" href="#cypher-intro-results-ordering-and-pagination"></a>Ordering and pagination</h2>
<div class="sectionbody">
<div class="paragraph">
<p>It is common to sort and paginate after aggregating using <code>count(x)</code>.</p>
</div>
<div class="paragraph">
<p>Ordering is done using the <code>ORDER BY expression [ASC|DESC]</code> clause.
The expression can be any expression, as long as it is computable from the returned information.</p>
</div>
<div class="paragraph">
<p>For instance, if you return <code>person.name</code> you can still <code>ORDER BY person.age</code> since both are accessible from the <code>person</code> reference.
You cannot order by things that are not returned.
This is especially important with aggregation and <code>DISTINCT</code> return values, since both remove the visibility of data that is aggregated.</p>
</div>
<div class="paragraph">
<p>Pagination is done using the <code>SKIP {offset}</code> and <code>LIMIT {count}</code> clauses.</p>
</div>
<div class="paragraph">
<p>A common pattern is to aggregate for a count (<em>score</em> or <em>frequency</em>), order by it, and only return the top-n entries.</p>
</div>
<div class="paragraph">
<p>For instance, to find the most prolific actors you could do:</p>
</div>
<div class="listingblock noplay">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (a:Person)-[:ACTED_IN]-&gt;(m:Movie)
RETURN a, count(*) AS appearances
ORDER BY appearances DESC LIMIT 10</code></pre>
</div>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 1

+---------------------------------------------------------+
| a                                         | appearances |
+---------------------------------------------------------+
| (:Person {name: 'Tom Hanks', born: 1956}) | 2           |
+---------------------------------------------------------+</pre>
</div>
</div>
<div class="sect2">
<h3 id="cypher-intro-results-ordering"><a class="anchor" href="#cypher-intro-results-ordering"></a>Ordering results</h3>
<div class="paragraph">
<p>Our list of potential hiring candidates from the preceding examples might be more useful if you could order the candidates by most or least experience.
Or perhaps you want to rank all of our people by age.</p>
</div>
<div class="paragraph">
<p>The <code>ORDER BY</code> keyword sorts the results based on the value you specify in ascending or descending order (ascending is default).
Let&#8217;s use the same queries from our <a href="#cypher-intro-results-unwind">examples with <code>UNWIND</code></a> and see how you can order the candidates.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//Query1: for a list of techRequirements, look for people who have each skill
WITH ['Graphs','Query Languages'] AS techRequirements
UNWIND techRequirements AS technology
MATCH (p:Person)-[r:LIKES]-(t:Technology {type: technology})
WITH t.type AS technology, p.name AS personName
ORDER BY technology, personName
RETURN technology, collect(personName) AS potentialCandidates;</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Query1 results:</strong></p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 2

+-------------------+------------------------------------------+
| technology        | potentialCandidates                      |
+-------------------+------------------------------------------+
| 'Graphs'          | ['Diana', 'Jennifer', 'Mark', 'Melissa'] |
| 'Query Languages' | ['Diana', Joe]                           |
+-------------------+------------------------------------------+</pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//Query2: for numbers in a list, find candidates who have that many years of experience
WITH [4, 5, 6, 7] AS experienceRange
UNWIND experienceRange AS number
MATCH (p:Person)
WHERE p.yearsExp = number
RETURN p.name, p.yearsExp ORDER BY p.yearsExp DESC;</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Query2 results:</strong></p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 4

+--------------+-----------------+
| p.name       | p.yearsExp      |
+--------------+-----------------+
| 'Dan'        | 6               |
| 'Jennifer'   | 5               |
| 'John'       | 5               |
| 'Sally'      | 4               |
+--------------+-----------------+</pre>
</div>
</div>
<div class="paragraph">
<p>Notice that the first query has to order by <code>Person</code> name before collecting the values into a list.
If you do not sort first (put the <code>ORDER BY</code> after the <code>RETURN</code> clause), you will sort based on the size of the list and not by the first letter of the values in the list.
The results are also sorted into two values: technology, then a person.
This allows you to sort the technology so that all the persons that like a technology are listed together.</p>
</div>
<div class="paragraph">
<p>You can try out the difference in sorting by both values or one value by running the following queries:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//only sorted by person's name in alphabetical order
WITH ['Graphs','Query Languages'] AS techRequirements
UNWIND techRequirements AS technology
MATCH (p:Person)-[r:LIKES]-(t:Technology {type: technology})
WITH t.type AS technology, p.name AS personName
ORDER BY personName
RETURN technology, personName;</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//only sorted by technology (person names are out of order)
WITH ['Graphs','Query Languages'] AS techRequirements
UNWIND techRequirements AS technology
MATCH (p:Person)-[r:LIKES]-(t:Technology {type: technology})
WITH t.type AS technology, p.name AS personName
ORDER BY technology
RETURN technology, personName;</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//sorted by technology, then by person's name
WITH ['Graphs','Query Languages'] AS techRequirements
UNWIND techRequirements AS technology
MATCH (p:Person)-[r:LIKES]-(t:Technology {type: technology})
WITH t.type AS technology, p.name AS personName
ORDER BY technology, personName
RETURN technology, personName;</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="aggregate-size"><a class="anchor" href="#aggregate-size"></a>Counting values in a list</h2>
<div class="sectionbody">
<div class="paragraph">
<p>If you have a list of values, you can also find the number of items in that list or calculate the size of an expression using the <code>size()</code> function.
The example below return the number of items found.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//Query1: find number of items in collected list
MATCH (p:Person)-[:IS_FRIENDS_WITH]-&gt;(friend:Person)
RETURN p.name, size(collect(friend.name)) AS numberOfFriends;</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Query1 results:</strong></p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 4

+--------------+-----------------+
| p.name       | numberOfFriends |
+--------------+-----------------+
| 'John'       | 1               |
| 'Jennifer'   | 5               |
| 'Ann'        | 1               |
| 'Joe'        | 2               |
+--------------+-----------------+</pre>
</div>
</div>
<div class="paragraph">
<p>In Neo4j v5, if you need to find a number of relationship patterns, use the <code>COUNT {}</code> expression.
Take a look at the following example of the Cypher query.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">//Query2: find number of friends who have other friends
MATCH (p:Person)-[:IS_FRIENDS_WITH]-&gt;(friend:Person)
WHERE count{(friend)-[:IS_FRIENDS_WITH]-(:Person)} &gt; 1
RETURN p.name, collect(friend.name) AS friends, count{(friend)-[:IS_FRIENDS_WITH]-(:Person)} AS numberOfFoFs;</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Query2 results:</strong></p>
</div>
<div class="listingblock queryresult">
<div class="content">
<pre>Rows: 3

+--------------+----------------------------------+---------------+
| p.name       | friends                          | numberOfFofs  |
+--------------+----------------------------------+---------------+
| 'Joe'        | ['Mark']                         | 2             |
| 'Jennifer'   | ['Mark', 'John', 'Sally', 'Ann'] | 2             |
| 'John'       | ['Sally']                        | 2             |
+--------------+----------------------------------+---------------+</pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="cypher-resources"><a class="anchor" href="#cypher-resources"></a>Resources</h2>
<div class="sectionbody">
<div class="ulist">
<ul>
<li>
<p><a href="https://neo4j.com/docs/cypher-manual/current/clauses/" target="_blank" rel="noopener">Neo4j Cypher Manual: WITH, UNWIND, &amp; More</a></p>
</li>
<li>
<p><a href="https://neo4j.com/docs/cypher-manual/current/functions/aggregating/" target="_blank" rel="noopener">Neo4j Cypher Manual: Aggregation</a></p>
</li>
<li>
<p><a href="https://neo4j.com/docs/cypher-manual/current/functions/scalar/#functions-size" target="_blank" rel="noopener">Neo4j Cypher Manual: size()</a></p>
</li>
</ul>
</div>
</div>
</div>
<nav class="pagination">
  <span class="prev"><a href="../patterns-in-practice/">Patterns in practice</a></span>

  <span class="next"><a href="../updating/">Updating the data</a></span>
</nav>
    <div class="feedback">
    <div class="header question">
        <p><strong>Was this page helpful?</strong></p>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="no" aria-label="No, this page isn't helpful">
            <path
                d="M6.25,15.8333333 C6.25,13.7622655 7.92893219,12.0833333 10,12.0833333 C12.0710678,12.0833333 13.75,13.7622655 13.75,15.8333333"
                ></path>
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M12.5,4.58333333 C12.8934466,4.05873783 13.5109223,3.75 14.1666667,3.75 C14.822411,3.75 15.4398867,4.05873783 15.8333333,4.58333333"
                ></path>
            <line x1="4.58333333" y1="7.91666667" x2="7.08333333" y2="7.91666667" ></line>
            <path
                d="M7.08333333,8.54166667 C6.96827401,8.54166667 6.875,8.44839266 6.875,8.33333333 C6.875,8.21827401 6.96827401,8.125 7.08333333,8.125 C7.19839266,8.125 7.29166667,8.21827401 7.29166667,8.33333333 C7.29166667,8.44839266 7.19839266,8.54166667 7.08333333,8.54166667"
                ></path>
            <line x1="12.9166667" y1="7.91666667" x2="15.4166667" y2="7.91666667" ></line>
            <path
                d="M15.4166667,8.54166667 C15.3016073,8.54166667 15.2083333,8.44839266 15.2083333,8.33333333 C15.2083333,8.21827401 15.3016073,8.125 15.4166667,8.125 C15.531726,8.125 15.625,8.21827401 15.625,8.33333333 C15.625,8.44839266 15.531726,8.54166667 15.4166667,8.54166667"
                ></path>
            <path
                d="M4.16666667,4.58333333 C4.5601133,4.05873783 5.17758895,3.75 5.83333333,3.75 C6.48907772,3.75 7.10655337,4.05873783 7.5,4.58333333"
                ></path>
        </svg>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="yes" aria-label="Yes, this page is helpful">
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M5.41666667,8.125 C5.53172599,8.125 5.625,8.21827401 5.625,8.33333333 C5.625,8.44839266 5.53172599,8.54166667 5.41666667,8.54166667 C5.30160734,8.54166667 5.20833333,8.44839266 5.20833333,8.33333333 C5.20833333,8.21827401 5.30160734,8.125 5.41666667,8.125"
                ></path>
            <path
                d="M14.5833333,8.125 C14.468274,8.125 14.375,8.21827401 14.375,8.33333333 C14.375,8.44839266 14.468274,8.54166667 14.5833333,8.54166667 C14.6983927,8.54166667 14.7916667,8.44839266 14.7916667,8.33333333 C14.7916667,8.21827401 14.6983927,8.125 14.5833333,8.125"
                ></path>
            <path
                d="M13.2275,12.9166657 C13.4853075,12.9162808 13.7287776,13.035241 13.8869095,13.2388563 C14.0450415,13.4424715 14.1000278,13.7078123 14.0358333,13.9575 C13.562901,15.7999679 11.9021969,17.0882321 10,17.0882321 C8.09780311,17.0882321 6.43709903,15.7999679 5.96416667,13.9575 C5.89997223,13.7078123 5.95495852,13.4424715 6.11309045,13.2388563 C6.27122239,13.035241 6.51469246,12.9162808 6.7725,12.9166657 L13.2275,12.9166657 Z"
                ></path>
        </svg>
    </div>


</div></article>
<aside class="toc sidebar" data-title="Contents"
  data-levels="2">
  <div class="toc-menu">
    <div class="toc-menu-placeholder"></div>

    <div class="toc-ad">
    <div class="toc-ad-overline">
        <a href="https://graphacademy.neo4j.com/courses/cypher-fundamentals" target="_blank">

        Neo4j GraphAcademy

        </a>
    </div>

    <a href="https://graphacademy.neo4j.com/courses/cypher-fundamentals" target="_blank">

        <h2 class="toc-ad-title">
            Cypher Fundamentals
        </h2>

        <p class="toc-ad-description">Learn Cypher in this free, hands-on course</p>

        <div class="toc-ad-underline button">
            Learn more
        </div>
    </a>
</div>
  </div>
  </aside>  </div>
</main>
</div>
<footer class="footer">
  <div class="wrapper">
  <div class="column">
    <div class="logo-footer"></div>
    <p> <span id="footer-copyright-year">2023</span> Neo4j, Inc.<br>
      <a href="https://neo4j.com/terms/">Terms</a> | <a href="https://neo4j.com/privacy-policy/">Privacy </a> | <a href="https://neo4j.com/sitemap/">Sitemap</a></p>
    <p>Neo4j<sup></sup>, Neo Technology<sup></sup>, Cypher<sup></sup>, Neo4j<sup></sup> Bloom<sup></sup> and
      Neo4j<sup></sup> Aura<sup></sup> are registered trademarks
      of Neo4j, Inc. All other marks are owned by their respective companies.</p>
  </div>

  <div class="column">
    <h2><a href="https://neo4j.com/contact-us/?ref=footer">Contact Us </a></h2>
    <p>US: 1-855-636-4532<br>
      Sweden +46 171 480 113<br>
      UK: +44 20 3868 3223<br>
      France: +33 (0) 1 88 46 13 20<br>
      <!--Germany: +49 (0)89 26204 6300</p>-->
    </p>
  </div>
  <div class="column links">
    <h2>Learn</h2>
    <ul>
      <li><i class="fa fa-wrench" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/sandbox/?ref=developer-footer">Sandbox</a></li>
      <li><i class="fa fa-comments-o" aria-hidden="true"></i> <a rel="noopener" href="https://community.neo4j.com?ref=developer-footer" target="_blank">Neo4j Community Site</a></li>
      <li><i class="fa fa-book" aria-hidden="true"></i> <a rel="noopener" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a></li>
      <li><i class="fa fa-youtube" aria-hidden="true"></i> <a rel="noopener" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a></li>
      <li><i class="fa fa-graduation-cap" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/graphacademy/?ref=developer-footer">GraphAcademy</a></li>
      <li><i class="fa fa-flask" aria-hidden="true"></i> <a href="https://neo4j.com/labs/?ref=developer-footer">Neo4j Labs</a></li>
    </ul>
  </div>
  <div class="column links">
    <h2>Social</h2>
    <ul>
      <li><i class="fa fa-twitter" aria-hidden="true"></i> <a rel="noopener" href="https://twitter.com/neo4j" target="_blank">Twitter</a></li>
      <li><i class="fa fa-meetup" aria-hidden="true"></i> <a rel="noopener" href="https://www.meetup.com/Neo4j-Online-Meetup/" target="_blank">Meetups</a></li>
      <li><i class="fa fa-github" aria-hidden="true"></i> <a rel="noopener" href="https://github.com/neo4j/neo4j" target="_blank">Github</a></li>
      <li><i class="fa fa-stack-overflow" aria-hidden="true"></i> <a rel="noopener" href="https://stackoverflow.com/questions/tagged/neo4j" target="_blank">Stack Overflow</a></li>

      <li class="speaker-program"><a href="https://docs.google.com/forms/d/e/1FAIpQLSdEcNnMruES5iwvOVYovmS1D_P1ZL_HdUOitFrwrvruv5PZvA/viewform">Want to Speak?</a></li>
    </ul>
  </div>
</div>
</footer>

  <script src="../../../assets/js/vendor/auth0.js"></script>
  <script src="../../../assets/js/site.js"></script>
  <script async src="../../../assets/js/vendor/highlight.js"></script>
  <script async src="../../../assets/js/vendor/image-zoom.js"></script>


<div id="neo4j-algolia-search-v2"></div>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.js"></script>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/polyfill.js"></script>
<script>window.algoliaSearchOptions = {indexName: "docs",placeholder: "Search Documentation",template: "docs"}</script>  </body>
</html>
